raphui/rnk/include/stm32f429.h
/** @addtogroup Peripheral_registers_structures
 * @{
 */   

/** 
 * @brief Analog to Digital Converter  
 */

typedef struct
{
	unsigned int SR;     /*!< ADC status register,                         Address offset: 0x00 */
	unsigned int CR1;    /*!< ADC control register 1,                      Address offset: 0x04 */      
	unsigned int CR2;    /*!< ADC control register 2,                      Address offset: 0x08 */
	unsigned int SMPR1;  /*!< ADC sample time register 1,                  Address offset: 0x0C */
	unsigned int SMPR2;  /*!< ADC sample time register 2,                  Address offset: 0x10 */
	unsigned int JOFR1;  /*!< ADC injected channel data offset register 1, Address offset: 0x14 */
	unsigned int JOFR2;  /*!< ADC injected channel data offset register 2, Address offset: 0x18 */
	unsigned int JOFR3;  /*!< ADC injected channel data offset register 3, Address offset: 0x1C */
	unsigned int JOFR4;  /*!< ADC injected channel data offset register 4, Address offset: 0x20 */
	unsigned int HTR;    /*!< ADC watchdog higher threshold register,      Address offset: 0x24 */
	unsigned int LTR;    /*!< ADC watchdog lower threshold register,       Address offset: 0x28 */
	unsigned int SQR1;   /*!< ADC regular sequence register 1,             Address offset: 0x2C */
	unsigned int SQR2;   /*!< ADC regular sequence register 2,             Address offset: 0x30 */
	unsigned int SQR3;   /*!< ADC regular sequence register 3,             Address offset: 0x34 */
	unsigned int JSQR;   /*!< ADC injected sequence register,              Address offset: 0x38*/
	unsigned int JDR1;   /*!< ADC injected data register 1,                Address offset: 0x3C */
	unsigned int JDR2;   /*!< ADC injected data register 2,                Address offset: 0x40 */
	unsigned int JDR3;   /*!< ADC injected data register 3,                Address offset: 0x44 */
	unsigned int JDR4;   /*!< ADC injected data register 4,                Address offset: 0x48 */
	unsigned int DR;     /*!< ADC regular data register,                   Address offset: 0x4C */
} ADC_TypeDef;

typedef struct
{
	unsigned int CSR;    /*!< ADC Common status register,                  Address offset: ADC1 base address + 0x300 */
	unsigned int CCR;    /*!< ADC common control register,                 Address offset: ADC1 base address + 0x304 */
	unsigned int CDR;    /*!< ADC common regular data register for dual
			       AND triple modes,                            Address offset: ADC1 base address + 0x308 */
} ADC_Common_TypeDef;


/** 
 * @brief Controller Area Network TxMailBox 
 */

typedef struct
{
	unsigned int TIR;  /*!< CAN TX mailbox identifier register */
	unsigned int TDTR; /*!< CAN mailbox data length control and time stamp register */
	unsigned int TDLR; /*!< CAN mailbox data low register */
	unsigned int TDHR; /*!< CAN mailbox data high register */
} CAN_TxMailBox_TypeDef;

/** 
 * @brief Controller Area Network FIFOMailBox 
 */

typedef struct
{
	unsigned int RIR;  /*!< CAN receive FIFO mailbox identifier register */
	unsigned int RDTR; /*!< CAN receive FIFO mailbox data length control and time stamp register */
	unsigned int RDLR; /*!< CAN receive FIFO mailbox data low register */
	unsigned int RDHR; /*!< CAN receive FIFO mailbox data high register */
} CAN_FIFOMailBox_TypeDef;

/** 
 * @brief Controller Area Network FilterRegister 
 */

typedef struct
{
	unsigned int FR1; /*!< CAN Filter bank register 1 */
	unsigned int FR2; /*!< CAN Filter bank register 1 */
} CAN_FilterRegister_TypeDef;

/** 
 * @brief Controller Area Network 
 */

typedef struct
{
	unsigned int              MCR;                 /*!< CAN master control register,         Address offset: 0x00          */
	unsigned int              MSR;                 /*!< CAN master status register,          Address offset: 0x04          */
	unsigned int              TSR;                 /*!< CAN transmit status register,        Address offset: 0x08          */
	unsigned int              RF0R;                /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
	unsigned int              RF1R;                /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
	unsigned int              IER;                 /*!< CAN interrupt enable register,       Address offset: 0x14          */
	unsigned int              ESR;                 /*!< CAN error status register,           Address offset: 0x18          */
	unsigned int              BTR;                 /*!< CAN bit timing register,             Address offset: 0x1C          */
	unsigned int                   RESERVED0[88];       /*!< Reserved, 0x020 - 0x17F                                            */
	CAN_TxMailBox_TypeDef      sTxMailBox[3];       /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
	CAN_FIFOMailBox_TypeDef    sFIFOMailBox[2];     /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
	unsigned int                   RESERVED1[12];       /*!< Reserved, 0x1D0 - 0x1FF                                            */
	unsigned int              FMR;                 /*!< CAN filter master register,          Address offset: 0x200         */
	unsigned int              FM1R;                /*!< CAN filter mode register,            Address offset: 0x204         */
	unsigned int                   RESERVED2;           /*!< Reserved, 0x208                                                    */
	unsigned int              FS1R;                /*!< CAN filter scale register,           Address offset: 0x20C         */
	unsigned int                   RESERVED3;           /*!< Reserved, 0x210                                                    */
	unsigned int              FFA1R;               /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
	unsigned int                   RESERVED4;           /*!< Reserved, 0x218                                                    */
	unsigned int              FA1R;                /*!< CAN filter activation register,      Address offset: 0x21C         */
	unsigned int                   RESERVED5[8];        /*!< Reserved, 0x220-0x23F                                              */ 
	CAN_FilterRegister_TypeDef sFilterRegister[28]; /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */
} CAN_TypeDef;

/** 
 * @brief CRC calculation unit 
 */

typedef struct
{
	unsigned int DR;         /*!< CRC Data register,             Address offset: 0x00 */
	unsigned char  IDR;        /*!< CRC Independent data register, Address offset: 0x04 */
	unsigned char       RESERVED0;  /*!< Reserved, 0x05                                      */
	unsigned short      RESERVED1;  /*!< Reserved, 0x06                                      */
	unsigned int CR;         /*!< CRC Control register,          Address offset: 0x08 */
} CRC_TypeDef;

/** 
 * @brief Digital to Analog Converter
 */

typedef struct
{
	unsigned int CR;       /*!< DAC control register,                                    Address offset: 0x00 */
	unsigned int SWTRIGR;  /*!< DAC software trigger register,                           Address offset: 0x04 */
	unsigned int DHR12R1;  /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
	unsigned int DHR12L1;  /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
	unsigned int DHR8R1;   /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
	unsigned int DHR12R2;  /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
	unsigned int DHR12L2;  /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
	unsigned int DHR8R2;   /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
	unsigned int DHR12RD;  /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
	unsigned int DHR12LD;  /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
	unsigned int DHR8RD;   /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
	unsigned int DOR1;     /*!< DAC channel1 data output register,                       Address offset: 0x2C */
	unsigned int DOR2;     /*!< DAC channel2 data output register,                       Address offset: 0x30 */
	unsigned int SR;       /*!< DAC status register,                                     Address offset: 0x34 */
} DAC_TypeDef;

/** 
 * @brief Debug MCU
 */

typedef struct
{
	unsigned int IDCODE;  /*!< MCU device ID code,               Address offset: 0x00 */
	unsigned int CR;      /*!< Debug MCU configuration register, Address offset: 0x04 */
	unsigned int APB1FZ;  /*!< Debug MCU APB1 freeze register,   Address offset: 0x08 */
	unsigned int APB2FZ;  /*!< Debug MCU APB2 freeze register,   Address offset: 0x0C */
}DBGMCU_TypeDef;

/** 
 * @brief DCMI
 */

typedef struct
{
	unsigned int CR;       /*!< DCMI control register 1,                       Address offset: 0x00 */
	unsigned int SR;       /*!< DCMI status register,                          Address offset: 0x04 */
	unsigned int RISR;     /*!< DCMI raw interrupt status register,            Address offset: 0x08 */
	unsigned int IER;      /*!< DCMI interrupt enable register,                Address offset: 0x0C */
	unsigned int MISR;     /*!< DCMI masked interrupt status register,         Address offset: 0x10 */
	unsigned int ICR;      /*!< DCMI interrupt clear register,                 Address offset: 0x14 */
	unsigned int ESCR;     /*!< DCMI embedded synchronization code register,   Address offset: 0x18 */
	unsigned int ESUR;     /*!< DCMI embedded synchronization unmask register, Address offset: 0x1C */
	unsigned int CWSTRTR;  /*!< DCMI crop window start,                        Address offset: 0x20 */
	unsigned int CWSIZER;  /*!< DCMI crop window size,                         Address offset: 0x24 */
	unsigned int DR;       /*!< DCMI data register,                            Address offset: 0x28 */
} DCMI_TypeDef;

/** 
 * @brief DMA Controller
 */

typedef struct
{
	unsigned int CR;     /*!< DMA stream x configuration register      */
	unsigned int NDTR;   /*!< DMA stream x number of data register     */
	unsigned int PAR;    /*!< DMA stream x peripheral address register */
	unsigned int M0AR;   /*!< DMA stream x memory 0 address register   */
	unsigned int M1AR;   /*!< DMA stream x memory 1 address register   */
	unsigned int FCR;    /*!< DMA stream x FIFO control register       */
} DMA_Stream_TypeDef;

typedef struct
{
	unsigned int LISR;   /*!< DMA low interrupt status register,      Address offset: 0x00 */
	unsigned int HISR;   /*!< DMA high interrupt status register,     Address offset: 0x04 */
	unsigned int LIFCR;  /*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
	unsigned int HIFCR;  /*!< DMA high interrupt flag clear register, Address offset: 0x0C */
} DMA_TypeDef;

/** 
 * @brief DMA2D Controller
 */

typedef struct
{
	unsigned int CR;            /*!< DMA2D Control Register,                         Address offset: 0x00 */
	unsigned int ISR;           /*!< DMA2D Interrupt Status Register,                Address offset: 0x04 */
	unsigned int IFCR;          /*!< DMA2D Interrupt Flag Clear Register,            Address offset: 0x08 */
	unsigned int FGMAR;         /*!< DMA2D Foreground Memory Address Register,       Address offset: 0x0C */
	unsigned int FGOR;          /*!< DMA2D Foreground Offset Register,               Address offset: 0x10 */
	unsigned int BGMAR;         /*!< DMA2D Background Memory Address Register,       Address offset: 0x14 */
	unsigned int BGOR;          /*!< DMA2D Background Offset Register,               Address offset: 0x18 */
	unsigned int FGPFCCR;       /*!< DMA2D Foreground PFC Control Register,          Address offset: 0x1C */
	unsigned int FGCOLR;        /*!< DMA2D Foreground Color Register,                Address offset: 0x20 */
	unsigned int BGPFCCR;       /*!< DMA2D Background PFC Control Register,          Address offset: 0x24 */
	unsigned int BGCOLR;        /*!< DMA2D Background Color Register,                Address offset: 0x28 */
	unsigned int FGCMAR;        /*!< DMA2D Foreground CLUT Memory Address Register,  Address offset: 0x2C */
	unsigned int BGCMAR;        /*!< DMA2D Background CLUT Memory Address Register,  Address offset: 0x30 */
	unsigned int OPFCCR;        /*!< DMA2D Output PFC Control Register,              Address offset: 0x34 */
	unsigned int OCOLR;         /*!< DMA2D Output Color Register,                    Address offset: 0x38 */
	unsigned int OMAR;          /*!< DMA2D Output Memory Address Register,           Address offset: 0x3C */
	unsigned int OOR;           /*!< DMA2D Output Offset Register,                   Address offset: 0x40 */
	unsigned int NLR;           /*!< DMA2D Number of Line Register,                  Address offset: 0x44 */
	unsigned int LWR;           /*!< DMA2D Line Watermark Register,                  Address offset: 0x48 */
	unsigned int AMTCR;         /*!< DMA2D AHB Master Timer Configuration Register,  Address offset: 0x4C */
	unsigned int      RESERVED[236]; /*!< Reserved, 0x50-0x3FF */
	unsigned int FGCLUT[256];   /*!< DMA2D Foreground CLUT,                          Address offset:400-7FF */
	unsigned int BGCLUT[256];   /*!< DMA2D Background CLUT,                          Address offset:800-BFF */
} DMA2D_TypeDef;

/** 
 * @brief Ethernet MAC
 */

typedef struct
{
	unsigned int MACCR;
	unsigned int MACFFR;
	unsigned int MACHTHR;
	unsigned int MACHTLR;
	unsigned int MACMIIAR;
	unsigned int MACMIIDR;
	unsigned int MACFCR;
	unsigned int MACVLANTR;             /*    8 */
	unsigned int      RESERVED0[2];
	unsigned int MACRWUFFR;             /*   11 */
	unsigned int MACPMTCSR;
	unsigned int      RESERVED1[2];
	unsigned int MACSR;                 /*   15 */
	unsigned int MACIMR;
	unsigned int MACA0HR;
	unsigned int MACA0LR;
	unsigned int MACA1HR;
	unsigned int MACA1LR;
	unsigned int MACA2HR;
	unsigned int MACA2LR;
	unsigned int MACA3HR;
	unsigned int MACA3LR;               /*   24 */
	unsigned int      RESERVED2[40];
	unsigned int MMCCR;                 /*   65 */
	unsigned int MMCRIR;
	unsigned int MMCTIR;
	unsigned int MMCRIMR;
	unsigned int MMCTIMR;               /*   69 */
	unsigned int      RESERVED3[14];
	unsigned int MMCTGFSCCR;            /*   84 */
	unsigned int MMCTGFMSCCR;
	unsigned int      RESERVED4[5];
	unsigned int MMCTGFCR;
	unsigned int      RESERVED5[10];
	unsigned int MMCRFCECR;
	unsigned int MMCRFAECR;
	unsigned int      RESERVED6[10];
	unsigned int MMCRGUFCR;
	unsigned int      RESERVED7[334];
	unsigned int PTPTSCR;
	unsigned int PTPSSIR;
	unsigned int PTPTSHR;
	unsigned int PTPTSLR;
	unsigned int PTPTSHUR;
	unsigned int PTPTSLUR;
	unsigned int PTPTSAR;
	unsigned int PTPTTHR;
	unsigned int PTPTTLR;
	unsigned int RESERVED8;
	unsigned int PTPTSSR;
	unsigned int      RESERVED9[565];
	unsigned int DMABMR;
	unsigned int DMATPDR;
	unsigned int DMARPDR;
	unsigned int DMARDLAR;
	unsigned int DMATDLAR;
	unsigned int DMASR;
	unsigned int DMAOMR;
	unsigned int DMAIER;
	unsigned int DMAMFBOCR;
	unsigned int DMARSWTR;
	unsigned int      RESERVED10[8];
	unsigned int DMACHTDR;
	unsigned int DMACHRDR;
	unsigned int DMACHTBAR;
	unsigned int DMACHRBAR;
} ETH_TypeDef;

/** 
 * @brief External Interrupt/Event Controller
 */

typedef struct
{
	unsigned int IMR;    /*!< EXTI Interrupt mask register,            Address offset: 0x00 */
	unsigned int EMR;    /*!< EXTI Event mask register,                Address offset: 0x04 */
	unsigned int RTSR;   /*!< EXTI Rising trigger selection register,  Address offset: 0x08 */
	unsigned int FTSR;   /*!< EXTI Falling trigger selection register, Address offset: 0x0C */
	unsigned int SWIER;  /*!< EXTI Software interrupt event register,  Address offset: 0x10 */
	unsigned int PR;     /*!< EXTI Pending register,                   Address offset: 0x14 */
} EXTI_TypeDef;

/** 
 * @brief FLASH Registers
 */

typedef struct
{
	unsigned int ACR;      /*!< FLASH access control register,   Address offset: 0x00 */
	unsigned int KEYR;     /*!< FLASH key register,              Address offset: 0x04 */
	unsigned int OPTKEYR;  /*!< FLASH option key register,       Address offset: 0x08 */
	unsigned int SR;       /*!< FLASH status register,           Address offset: 0x0C */
	unsigned int CR;       /*!< FLASH control register,          Address offset: 0x10 */
	unsigned int OPTCR;    /*!< FLASH option control register ,  Address offset: 0x14 */
	unsigned int OPTCR1;   /*!< FLASH option control register 1, Address offset: 0x18 */
} FLASH_TypeDef;

/** 
 * @brief Flexible Memory Controller
 */

typedef struct
{
	unsigned int BTCR[8];    /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */   
} FMC_Bank1_TypeDef; 

/** 
 * @brief Flexible Memory Controller Bank1E
 */

typedef struct
{
	unsigned int BWTR[7];    /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
} FMC_Bank1E_TypeDef;

/** 
 * @brief Flexible Memory Controller Bank2
 */

typedef struct
{
	unsigned int PCR2;       /*!< NAND Flash control register 2,                       Address offset: 0x60 */
	unsigned int SR2;        /*!< NAND Flash FIFO status and interrupt register 2,     Address offset: 0x64 */
	unsigned int PMEM2;      /*!< NAND Flash Common memory space timing register 2,    Address offset: 0x68 */
	unsigned int PATT2;      /*!< NAND Flash Attribute memory space timing register 2, Address offset: 0x6C */
	unsigned int      RESERVED0;  /*!< Reserved, 0x70                                                            */
	unsigned int ECCR2;      /*!< NAND Flash ECC result registers 2,                   Address offset: 0x74 */
} FMC_Bank2_TypeDef;

/** 
 * @brief Flexible Memory Controller Bank3
 */

typedef struct
{
	unsigned int PCR3;       /*!< NAND Flash control register 3,                       Address offset: 0x80 */
	unsigned int SR3;        /*!< NAND Flash FIFO status and interrupt register 3,     Address offset: 0x84 */
	unsigned int PMEM3;      /*!< NAND Flash Common memory space timing register 3,    Address offset: 0x88 */
	unsigned int PATT3;      /*!< NAND Flash Attribute memory space timing register 3, Address offset: 0x8C */
	unsigned int      RESERVED0;  /*!< Reserved, 0x90                                                            */
	unsigned int ECCR3;      /*!< NAND Flash ECC result registers 3,                   Address offset: 0x94 */
} FMC_Bank3_TypeDef;

/** 
 * @brief Flexible Memory Controller Bank4
 */

typedef struct
{
	unsigned int PCR4;       /*!< PC Card  control register 4,                       Address offset: 0xA0 */
	unsigned int SR4;        /*!< PC Card  FIFO status and interrupt register 4,     Address offset: 0xA4 */
	unsigned int PMEM4;      /*!< PC Card  Common memory space timing register 4,    Address offset: 0xA8 */
	unsigned int PATT4;      /*!< PC Card  Attribute memory space timing register 4, Address offset: 0xAC */
	unsigned int PIO4;       /*!< PC Card  I/O space timing register 4,              Address offset: 0xB0 */
} FMC_Bank4_TypeDef; 

/** 
 * @brief Flexible Memory Controller Bank5_6
 */

typedef struct
{
	unsigned int SDCR[2];        /*!< SDRAM Control registers ,      Address offset: 0x140-0x144  */
	unsigned int SDTR[2];        /*!< SDRAM Timing registers ,       Address offset: 0x148-0x14C  */
	unsigned int SDCMR;       /*!< SDRAM Command Mode register,    Address offset: 0x150  */
	unsigned int SDRTR;       /*!< SDRAM Refresh Timer register,   Address offset: 0x154  */
	unsigned int SDSR;        /*!< SDRAM Status register,          Address offset: 0x158  */
} FMC_Bank5_6_TypeDef; 

/** 
 * @brief General Purpose I/O
 */

typedef struct
{
	unsigned int MODER;    /*!< GPIO port mode register,               Address offset: 0x00      */
	unsigned int OTYPER;   /*!< GPIO port output type register,        Address offset: 0x04      */
	unsigned int OSPEEDR;  /*!< GPIO port output speed register,       Address offset: 0x08      */
	unsigned int PUPDR;    /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
	unsigned int IDR;      /*!< GPIO port input data register,         Address offset: 0x10      */
	unsigned int ODR;      /*!< GPIO port output data register,        Address offset: 0x14      */
	unsigned short BSRRL;    /*!< GPIO port bit set/reset low register,  Address offset: 0x18      */
	unsigned short BSRRH;    /*!< GPIO port bit set/reset high register, Address offset: 0x1A      */
	unsigned int LCKR;     /*!< GPIO port configuration lock register, Address offset: 0x1C      */
	unsigned int AFR[2];   /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
} GPIO_TypeDef;

/** 
 * @brief System configuration controller
 */

typedef struct
{
	unsigned int MEMRMP;       /*!< SYSCFG memory remap register,                      Address offset: 0x00      */
	unsigned int PMC;          /*!< SYSCFG peripheral mode configuration register,     Address offset: 0x04      */
	unsigned int EXTICR[4];    /*!< SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14 */
	unsigned int      RESERVED[2];  /*!< Reserved, 0x18-0x1C                                                          */ 
	unsigned int CMPCR;        /*!< SYSCFG Compensation cell control register,         Address offset: 0x20      */
} SYSCFG_TypeDef;

/** 
 * @brief Inter-integrated Circuit Interface
 */

typedef struct
{
	unsigned short CR1;        /*!< I2C Control register 1,     Address offset: 0x00 */
	unsigned short      RESERVED0;  /*!< Reserved, 0x02                                   */
	unsigned short CR2;        /*!< I2C Control register 2,     Address offset: 0x04 */
	unsigned short      RESERVED1;  /*!< Reserved, 0x06                                   */
	unsigned short OAR1;       /*!< I2C Own address register 1, Address offset: 0x08 */
	unsigned short      RESERVED2;  /*!< Reserved, 0x0A                                   */
	unsigned short OAR2;       /*!< I2C Own address register 2, Address offset: 0x0C */
	unsigned short      RESERVED3;  /*!< Reserved, 0x0E                                   */
	unsigned short DR;         /*!< I2C Data register,          Address offset: 0x10 */
	unsigned short      RESERVED4;  /*!< Reserved, 0x12                                   */
	unsigned short SR1;        /*!< I2C Status register 1,      Address offset: 0x14 */
	unsigned short      RESERVED5;  /*!< Reserved, 0x16                                   */
	unsigned short SR2;        /*!< I2C Status register 2,      Address offset: 0x18 */
	unsigned short      RESERVED6;  /*!< Reserved, 0x1A                                   */
	unsigned short CCR;        /*!< I2C Clock control register, Address offset: 0x1C */
	unsigned short      RESERVED7;  /*!< Reserved, 0x1E                                   */
	unsigned short TRISE;      /*!< I2C TRISE register,         Address offset: 0x20 */
	unsigned short      RESERVED8;  /*!< Reserved, 0x22                                   */
	unsigned short FLTR;       /*!< I2C FLTR register,          Address offset: 0x24 */
	unsigned short      RESERVED9;  /*!< Reserved, 0x26                                   */
} I2C_TypeDef;

/** 
 * @brief Independent WATCHDOG
 */

