raphui/rnk/include/stm32f429.h
typedef struct
{
	unsigned int CR;         /*!< CRYP control register,                                    Address offset: 0x00 */
	unsigned int SR;         /*!< CRYP status register,                                     Address offset: 0x04 */
	unsigned int DR;         /*!< CRYP data input register,                                 Address offset: 0x08 */
	unsigned int DOUT;       /*!< CRYP data output register,                                Address offset: 0x0C */
	unsigned int DMACR;      /*!< CRYP DMA control register,                                Address offset: 0x10 */
	unsigned int IMSCR;      /*!< CRYP interrupt mask set/clear register,                   Address offset: 0x14 */
	unsigned int RISR;       /*!< CRYP raw interrupt status register,                       Address offset: 0x18 */
	unsigned int MISR;       /*!< CRYP masked interrupt status register,                    Address offset: 0x1C */
	unsigned int K0LR;       /*!< CRYP key left  register 0,                                Address offset: 0x20 */
	unsigned int K0RR;       /*!< CRYP key right register 0,                                Address offset: 0x24 */
	unsigned int K1LR;       /*!< CRYP key left  register 1,                                Address offset: 0x28 */
	unsigned int K1RR;       /*!< CRYP key right register 1,                                Address offset: 0x2C */
	unsigned int K2LR;       /*!< CRYP key left  register 2,                                Address offset: 0x30 */
	unsigned int K2RR;       /*!< CRYP key right register 2,                                Address offset: 0x34 */
	unsigned int K3LR;       /*!< CRYP key left  register 3,                                Address offset: 0x38 */
	unsigned int K3RR;       /*!< CRYP key right register 3,                                Address offset: 0x3C */
	unsigned int IV0LR;      /*!< CRYP initialization vector left-word  register 0,         Address offset: 0x40 */
	unsigned int IV0RR;      /*!< CRYP initialization vector right-word register 0,         Address offset: 0x44 */
	unsigned int IV1LR;      /*!< CRYP initialization vector left-word  register 1,         Address offset: 0x48 */
	unsigned int IV1RR;      /*!< CRYP initialization vector right-word register 1,         Address offset: 0x4C */
	unsigned int CSGCMCCM0R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 0,        Address offset: 0x50 */
	unsigned int CSGCMCCM1R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 1,        Address offset: 0x54 */
	unsigned int CSGCMCCM2R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 2,        Address offset: 0x58 */
	unsigned int CSGCMCCM3R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 3,        Address offset: 0x5C */
	unsigned int CSGCMCCM4R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 4,        Address offset: 0x60 */
	unsigned int CSGCMCCM5R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 5,        Address offset: 0x64 */
	unsigned int CSGCMCCM6R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 6,        Address offset: 0x68 */
	unsigned int CSGCMCCM7R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 7,        Address offset: 0x6C */
	unsigned int CSGCM0R;    /*!< CRYP GCM/GMAC context swap register 0,                    Address offset: 0x70 */
	unsigned int CSGCM1R;    /*!< CRYP GCM/GMAC context swap register 1,                    Address offset: 0x74 */
	unsigned int CSGCM2R;    /*!< CRYP GCM/GMAC context swap register 2,                    Address offset: 0x78 */
	unsigned int CSGCM3R;    /*!< CRYP GCM/GMAC context swap register 3,                    Address offset: 0x7C */
	unsigned int CSGCM4R;    /*!< CRYP GCM/GMAC context swap register 4,                    Address offset: 0x80 */
	unsigned int CSGCM5R;    /*!< CRYP GCM/GMAC context swap register 5,                    Address offset: 0x84 */
	unsigned int CSGCM6R;    /*!< CRYP GCM/GMAC context swap register 6,                    Address offset: 0x88 */
	unsigned int CSGCM7R;    /*!< CRYP GCM/GMAC context swap register 7,                    Address offset: 0x8C */
} CRYP_TypeDef;

/** 
 * @brief HASH
 */

typedef struct 
{
	unsigned int CR;               /*!< HASH control register,          Address offset: 0x00        */
	unsigned int DIN;              /*!< HASH data input register,       Address offset: 0x04        */
	unsigned int STR;              /*!< HASH start register,            Address offset: 0x08        */
	unsigned int HR[5];            /*!< HASH digest registers,          Address offset: 0x0C-0x1C   */
	unsigned int IMR;              /*!< HASH interrupt enable register, Address offset: 0x20        */
	unsigned int SR;               /*!< HASH status register,           Address offset: 0x24        */
	unsigned int RESERVED[52];     /*!< Reserved, 0x28-0xF4                                         */
	unsigned int CSR[54];          /*!< HASH context swap registers,    Address offset: 0x0F8-0x1CC */
} HASH_TypeDef;

/** 
 * @brief HASH_DIGEST
 */

typedef struct 
{
	unsigned int HR[8];     /*!< HASH digest registers,          Address offset: 0x310-0x32C */ 
} HASH_DIGEST_TypeDef;

/** 
 * @brief RNG
 */

typedef struct 
{
	unsigned int CR;  /*!< RNG control register, Address offset: 0x00 */
	unsigned int SR;  /*!< RNG status register,  Address offset: 0x04 */
	unsigned int DR;  /*!< RNG data register,    Address offset: 0x08 */
} RNG_TypeDef;

/**
 * @}
 */

/** @addtogroup Peripheral_memory_map
 * @{
 */
#define FLASH_BASE            ((unsigned int)0x08000000) /*!< FLASH(up to 1 MB) base address in the alias region                         */
#define CCMDATARAM_BASE       ((unsigned int)0x10000000) /*!< CCM(core coupled memory) data RAM(64 KB) base address in the alias region  */
#define SRAM1_BASE            ((unsigned int)0x20000000) /*!< SRAM1(112 KB) base address in the alias region                             */
#define SRAM2_BASE            ((unsigned int)0x2001C000) /*!< SRAM2(16 KB) base address in the alias region                              */
#define SRAM3_BASE            ((unsigned int)0x20020000) /*!< SRAM3(64 KB) base address in the alias region                              */
#define PERIPH_BASE           ((unsigned int)0x40000000) /*!< Peripheral base address in the alias region                                */
#define BKPSRAM_BASE          ((unsigned int)0x40024000) /*!< Backup SRAM(4 KB) base address in the alias region                         */

#define FMC_R_BASE            ((unsigned int)0xA0000000) /*!< FMC registers base address */        

