raphui/rnk/include/stm32f429.h
/* Debug MCU registers base address */
#define DBGMCU_BASE           ((unsigned int )0xE0042000)

/**
 * @}
 */

/** @addtogroup Peripheral_declaration
 * @{
 */
#define TIM2                ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                ((TIM_TypeDef *) TIM4_BASE)
#define TIM5                ((TIM_TypeDef *) TIM5_BASE)
#define TIM6                ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                ((TIM_TypeDef *) TIM7_BASE)
#define TIM12               ((TIM_TypeDef *) TIM12_BASE)
#define TIM13               ((TIM_TypeDef *) TIM13_BASE)
#define TIM14               ((TIM_TypeDef *) TIM14_BASE)
#define RTC                 ((RTC_TypeDef *) RTC_BASE)
#define WWDG                ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                ((IWDG_TypeDef *) IWDG_BASE)
#define I2S2ext             ((SPI_TypeDef *) I2S2ext_BASE)
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                ((SPI_TypeDef *) SPI3_BASE)
#define I2S3ext             ((SPI_TypeDef *) I2S3ext_BASE)
#define USART2              ((USART_TypeDef *) USART2_BASE)
#define USART3              ((USART_TypeDef *) USART3_BASE)
#define UART4               ((USART_TypeDef *) UART4_BASE)
#define UART5               ((USART_TypeDef *) UART5_BASE)
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                ((I2C_TypeDef *) I2C3_BASE)
#define CAN1                ((CAN_TypeDef *) CAN1_BASE)
#define CAN2                ((CAN_TypeDef *) CAN2_BASE)
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#define DAC                 ((DAC_TypeDef *) DAC_BASE)
#define UART7               ((USART_TypeDef *) UART7_BASE)
#define UART8               ((USART_TypeDef *) UART8_BASE)
#define TIM1                ((TIM_TypeDef *) TIM1_BASE)
#define TIM8                ((TIM_TypeDef *) TIM8_BASE)
#define USART1              ((USART_TypeDef *) USART1_BASE)
#define USART6              ((USART_TypeDef *) USART6_BASE)
#define ADC                 ((ADC_Common_TypeDef *) ADC_BASE)
#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                ((ADC_TypeDef *) ADC2_BASE)
#define ADC3                ((ADC_TypeDef *) ADC3_BASE)
#define SDIO                ((SDIO_TypeDef *) SDIO_BASE)
#define SPI1                ((SPI_TypeDef *) SPI1_BASE) 
#define SPI4                ((SPI_TypeDef *) SPI4_BASE)
#define SYSCFG              ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define EXTI                ((EXTI_TypeDef *) EXTI_BASE)
#define TIM9                ((TIM_TypeDef *) TIM9_BASE)
#define TIM10               ((TIM_TypeDef *) TIM10_BASE)
#define TIM11               ((TIM_TypeDef *) TIM11_BASE)
#define SPI5                ((SPI_TypeDef *) SPI5_BASE)
#define SPI6                ((SPI_TypeDef *) SPI6_BASE)
#define SAI1                ((SAI_TypeDef *) SAI1_BASE)
#define SAI1_Block_A        ((SAI_Block_TypeDef *)SAI1_Block_A_BASE)
#define SAI1_Block_B        ((SAI_Block_TypeDef *)SAI1_Block_B_BASE)
#define LTDC                ((LTDC_TypeDef *)LTDC_BASE)
#define LTDC_Layer1         ((LTDC_Layer_TypeDef *)LTDC_Layer1_BASE)
#define LTDC_Layer2         ((LTDC_Layer_TypeDef *)LTDC_Layer2_BASE)
#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF               ((GPIO_TypeDef *) GPIOF_BASE)
#define GPIOG               ((GPIO_TypeDef *) GPIOG_BASE)
#define GPIOH               ((GPIO_TypeDef *) GPIOH_BASE)
#define GPIOI               ((GPIO_TypeDef *) GPIOI_BASE)
#define GPIOJ               ((GPIO_TypeDef *) GPIOJ_BASE)
#define GPIOK               ((GPIO_TypeDef *) GPIOK_BASE)
#define CRC                 ((CRC_TypeDef *) CRC_BASE)
#define RCC                 ((RCC_TypeDef *) RCC_BASE)
#define FLASH               ((FLASH_TypeDef *) FLASH_R_BASE)
#define DMA1                ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Stream0        ((DMA_Stream_TypeDef *) DMA1_Stream0_BASE)
#define DMA1_Stream1        ((DMA_Stream_TypeDef *) DMA1_Stream1_BASE)
#define DMA1_Stream2        ((DMA_Stream_TypeDef *) DMA1_Stream2_BASE)
#define DMA1_Stream3        ((DMA_Stream_TypeDef *) DMA1_Stream3_BASE)
#define DMA1_Stream4        ((DMA_Stream_TypeDef *) DMA1_Stream4_BASE)
#define DMA1_Stream5        ((DMA_Stream_TypeDef *) DMA1_Stream5_BASE)
#define DMA1_Stream6        ((DMA_Stream_TypeDef *) DMA1_Stream6_BASE)
#define DMA1_Stream7        ((DMA_Stream_TypeDef *) DMA1_Stream7_BASE)
#define DMA2                ((DMA_TypeDef *) DMA2_BASE)
#define DMA2_Stream0        ((DMA_Stream_TypeDef *) DMA2_Stream0_BASE)
#define DMA2_Stream1        ((DMA_Stream_TypeDef *) DMA2_Stream1_BASE)
#define DMA2_Stream2        ((DMA_Stream_TypeDef *) DMA2_Stream2_BASE)
#define DMA2_Stream3        ((DMA_Stream_TypeDef *) DMA2_Stream3_BASE)
#define DMA2_Stream4        ((DMA_Stream_TypeDef *) DMA2_Stream4_BASE)
#define DMA2_Stream5        ((DMA_Stream_TypeDef *) DMA2_Stream5_BASE)
#define DMA2_Stream6        ((DMA_Stream_TypeDef *) DMA2_Stream6_BASE)
#define DMA2_Stream7        ((DMA_Stream_TypeDef *) DMA2_Stream7_BASE)
#define ETH                 ((ETH_TypeDef *) ETH_BASE)  
#define DMA2D               ((DMA2D_TypeDef *)DMA2D_BASE)
#define DCMI                ((DCMI_TypeDef *) DCMI_BASE)
#define CRYP                ((CRYP_TypeDef *) CRYP_BASE)
#define HASH                ((HASH_TypeDef *) HASH_BASE)
#define HASH_DIGEST         ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE)
#define RNG                 ((RNG_TypeDef *) RNG_BASE)
#define FMC_Bank1           ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE)
#define FMC_Bank1E          ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE)
#define FMC_Bank2           ((FMC_Bank2_TypeDef *) FMC_Bank2_R_BASE)
#define FMC_Bank3           ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE)
#define FMC_Bank4           ((FMC_Bank4_TypeDef *) FMC_Bank4_R_BASE)
#define FMC_Bank5_6         ((FMC_Bank5_6_TypeDef *) FMC_Bank5_6_R_BASE)

#define DBGMCU              ((DBGMCU_TypeDef *) DBGMCU_BASE)

/**
 * @}
 */

/** @addtogroup Exported_constants
 * @{
 */

/** @addtogroup Peripheral_Registers_Bits_Definition
 * @{
 */

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for ADC_SR register  ********************/
#define  ADC_SR_AWD                          ((unsigned char)0x01)               /*!<Analog watchdog flag               */
#define  ADC_SR_EOC                          ((unsigned char)0x02)               /*!<End of conversion                  */
#define  ADC_SR_JEOC                         ((unsigned char)0x04)               /*!<Injected channel end of conversion */
#define  ADC_SR_JSTRT                        ((unsigned char)0x08)               /*!<Injected channel Start flag        */
#define  ADC_SR_STRT                         ((unsigned char)0x10)               /*!<Regular channel Start flag         */
#define  ADC_SR_OVR                          ((unsigned char)0x20)               /*!<Overrun flag                       */

/*******************  Bit definition for ADC_CR1 register  ********************/
#define  ADC_CR1_AWDCH                       ((unsigned int)0x0000001F)        /*!<AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define  ADC_CR1_AWDCH_0                     ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  ADC_CR1_AWDCH_1                     ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  ADC_CR1_AWDCH_2                     ((unsigned int)0x00000004)        /*!<Bit 2 */
#define  ADC_CR1_AWDCH_3                     ((unsigned int)0x00000008)        /*!<Bit 3 */
#define  ADC_CR1_AWDCH_4                     ((unsigned int)0x00000010)        /*!<Bit 4 */
#define  ADC_CR1_EOCIE                       ((unsigned int)0x00000020)        /*!<Interrupt enable for EOC                              */
#define  ADC_CR1_AWDIE                       ((unsigned int)0x00000040)        /*!<AAnalog Watchdog interrupt enable                     */
#define  ADC_CR1_JEOCIE                      ((unsigned int)0x00000080)        /*!<Interrupt enable for injected channels                */
#define  ADC_CR1_SCAN                        ((unsigned int)0x00000100)        /*!<Scan mode                                             */
#define  ADC_CR1_AWDSGL                      ((unsigned int)0x00000200)        /*!<Enable the watchdog on a single channel in scan mode  */
#define  ADC_CR1_JAUTO                       ((unsigned int)0x00000400)        /*!<Automatic injected group conversion                   */
#define  ADC_CR1_DISCEN                      ((unsigned int)0x00000800)        /*!<Discontinuous mode on regular channels                */
#define  ADC_CR1_JDISCEN                     ((unsigned int)0x00001000)        /*!<Discontinuous mode on injected channels               */
#define  ADC_CR1_DISCNUM                     ((unsigned int)0x0000E000)        /*!<DISCNUM[2:0] bits (Discontinuous mode channel count)  */
#define  ADC_CR1_DISCNUM_0                   ((unsigned int)0x00002000)        /*!<Bit 0 */
#define  ADC_CR1_DISCNUM_1                   ((unsigned int)0x00004000)        /*!<Bit 1 */
#define  ADC_CR1_DISCNUM_2                   ((unsigned int)0x00008000)        /*!<Bit 2 */
#define  ADC_CR1_JAWDEN                      ((unsigned int)0x00400000)        /*!<Analog watchdog enable on injected channels           */
#define  ADC_CR1_AWDEN                       ((unsigned int)0x00800000)        /*!<Analog watchdog enable on regular channels            */
#define  ADC_CR1_RES                         ((unsigned int)0x03000000)        /*!<RES[2:0] bits (Resolution)                            */
#define  ADC_CR1_RES_0                       ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  ADC_CR1_RES_1                       ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  ADC_CR1_OVRIE                       ((unsigned int)0x04000000)         /*!<overrun interrupt enable                              */

/*******************  Bit definition for ADC_CR2 register  ********************/
#define  ADC_CR2_ADON                        ((unsigned int)0x00000001)        /*!<A/D Converter ON / OFF             */
#define  ADC_CR2_CONT                        ((unsigned int)0x00000002)        /*!<Continuous Conversion              */
#define  ADC_CR2_DMA                         ((unsigned int)0x00000100)        /*!<Direct Memory access mode          */
#define  ADC_CR2_DDS                         ((unsigned int)0x00000200)        /*!<DMA disable selection (Single ADC) */
#define  ADC_CR2_EOCS                        ((unsigned int)0x00000400)        /*!<End of conversion selection        */
#define  ADC_CR2_ALIGN                       ((unsigned int)0x00000800)        /*!<Data Alignment                     */
#define  ADC_CR2_JEXTSEL                     ((unsigned int)0x000F0000)        /*!<JEXTSEL[3:0] bits (External event select for injected group) */
#define  ADC_CR2_JEXTSEL_0                   ((unsigned int)0x00010000)        /*!<Bit 0 */
#define  ADC_CR2_JEXTSEL_1                   ((unsigned int)0x00020000)        /*!<Bit 1 */
#define  ADC_CR2_JEXTSEL_2                   ((unsigned int)0x00040000)        /*!<Bit 2 */
#define  ADC_CR2_JEXTSEL_3                   ((unsigned int)0x00080000)        /*!<Bit 3 */
#define  ADC_CR2_JEXTEN                      ((unsigned int)0x00300000)        /*!<JEXTEN[1:0] bits (External Trigger Conversion mode for injected channelsp) */
#define  ADC_CR2_JEXTEN_0                    ((unsigned int)0x00100000)        /*!<Bit 0 */
#define  ADC_CR2_JEXTEN_1                    ((unsigned int)0x00200000)        /*!<Bit 1 */
#define  ADC_CR2_JSWSTART                    ((unsigned int)0x00400000)        /*!<Start Conversion of injected channels */
#define  ADC_CR2_EXTSEL                      ((unsigned int)0x0F000000)        /*!<EXTSEL[3:0] bits (External Event Select for regular group) */
#define  ADC_CR2_EXTSEL_0                    ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  ADC_CR2_EXTSEL_1                    ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  ADC_CR2_EXTSEL_2                    ((unsigned int)0x04000000)        /*!<Bit 2 */
#define  ADC_CR2_EXTSEL_3                    ((unsigned int)0x08000000)        /*!<Bit 3 */
#define  ADC_CR2_EXTEN                       ((unsigned int)0x30000000)        /*!<EXTEN[1:0] bits (External Trigger Conversion mode for regular channelsp) */
#define  ADC_CR2_EXTEN_0                     ((unsigned int)0x10000000)        /*!<Bit 0 */
#define  ADC_CR2_EXTEN_1                     ((unsigned int)0x20000000)        /*!<Bit 1 */
#define  ADC_CR2_SWSTART                     ((unsigned int)0x40000000)        /*!<Start Conversion of regular channels */

/******************  Bit definition for ADC_SMPR1 register  *******************/
#define  ADC_SMPR1_SMP10                     ((unsigned int)0x00000007)        /*!<SMP10[2:0] bits (Channel 10 Sample time selection) */
#define  ADC_SMPR1_SMP10_0                   ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP10_1                   ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP10_2                   ((unsigned int)0x00000004)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP11                     ((unsigned int)0x00000038)        /*!<SMP11[2:0] bits (Channel 11 Sample time selection) */
#define  ADC_SMPR1_SMP11_0                   ((unsigned int)0x00000008)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP11_1                   ((unsigned int)0x00000010)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP11_2                   ((unsigned int)0x00000020)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP12                     ((unsigned int)0x000001C0)        /*!<SMP12[2:0] bits (Channel 12 Sample time selection) */
#define  ADC_SMPR1_SMP12_0                   ((unsigned int)0x00000040)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP12_1                   ((unsigned int)0x00000080)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP12_2                   ((unsigned int)0x00000100)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP13                     ((unsigned int)0x00000E00)        /*!<SMP13[2:0] bits (Channel 13 Sample time selection) */
#define  ADC_SMPR1_SMP13_0                   ((unsigned int)0x00000200)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP13_1                   ((unsigned int)0x00000400)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP13_2                   ((unsigned int)0x00000800)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP14                     ((unsigned int)0x00007000)        /*!<SMP14[2:0] bits (Channel 14 Sample time selection) */
#define  ADC_SMPR1_SMP14_0                   ((unsigned int)0x00001000)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP14_1                   ((unsigned int)0x00002000)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP14_2                   ((unsigned int)0x00004000)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP15                     ((unsigned int)0x00038000)        /*!<SMP15[2:0] bits (Channel 15 Sample time selection) */
#define  ADC_SMPR1_SMP15_0                   ((unsigned int)0x00008000)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP15_1                   ((unsigned int)0x00010000)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP15_2                   ((unsigned int)0x00020000)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP16                     ((unsigned int)0x001C0000)        /*!<SMP16[2:0] bits (Channel 16 Sample time selection) */
#define  ADC_SMPR1_SMP16_0                   ((unsigned int)0x00040000)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP16_1                   ((unsigned int)0x00080000)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP16_2                   ((unsigned int)0x00100000)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP17                     ((unsigned int)0x00E00000)        /*!<SMP17[2:0] bits (Channel 17 Sample time selection) */
#define  ADC_SMPR1_SMP17_0                   ((unsigned int)0x00200000)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP17_1                   ((unsigned int)0x00400000)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP17_2                   ((unsigned int)0x00800000)        /*!<Bit 2 */
#define  ADC_SMPR1_SMP18                     ((unsigned int)0x07000000)        /*!<SMP18[2:0] bits (Channel 18 Sample time selection) */
#define  ADC_SMPR1_SMP18_0                   ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  ADC_SMPR1_SMP18_1                   ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  ADC_SMPR1_SMP18_2                   ((unsigned int)0x04000000)        /*!<Bit 2 */

