raphui/rnk/include/stm32f429.h
/*****************  Bit definition for DAC_DHR12L2 register  ******************/
#define  DAC_DHR12L2_DACC2DHR                ((unsigned short)0xFFF0)            /*!<DAC channel2 12-bit Left aligned data */

/******************  Bit definition for DAC_DHR8R2 register  ******************/
#define  DAC_DHR8R2_DACC2DHR                 ((unsigned char)0xFF)               /*!<DAC channel2 8-bit Right aligned data */

/*****************  Bit definition for DAC_DHR12RD register  ******************/
#define  DAC_DHR12RD_DACC1DHR                ((unsigned int)0x00000FFF)        /*!<DAC channel1 12-bit Right aligned data */
#define  DAC_DHR12RD_DACC2DHR                ((unsigned int)0x0FFF0000)        /*!<DAC channel2 12-bit Right aligned data */

/*****************  Bit definition for DAC_DHR12LD register  ******************/
#define  DAC_DHR12LD_DACC1DHR                ((unsigned int)0x0000FFF0)        /*!<DAC channel1 12-bit Left aligned data */
#define  DAC_DHR12LD_DACC2DHR                ((unsigned int)0xFFF00000)        /*!<DAC channel2 12-bit Left aligned data */

/******************  Bit definition for DAC_DHR8RD register  ******************/
#define  DAC_DHR8RD_DACC1DHR                 ((unsigned short)0x00FF)            /*!<DAC channel1 8-bit Right aligned data */
#define  DAC_DHR8RD_DACC2DHR                 ((unsigned short)0xFF00)            /*!<DAC channel2 8-bit Right aligned data */

/*******************  Bit definition for DAC_DOR1 register  *******************/
#define  DAC_DOR1_DACC1DOR                   ((unsigned short)0x0FFF)            /*!<DAC channel1 data output */

/*******************  Bit definition for DAC_DOR2 register  *******************/
#define  DAC_DOR2_DACC2DOR                   ((unsigned short)0x0FFF)            /*!<DAC channel2 data output */

/********************  Bit definition for DAC_SR register  ********************/
#define  DAC_SR_DMAUDR1                      ((unsigned int)0x00002000)        /*!<DAC channel1 DMA underrun flag */
#define  DAC_SR_DMAUDR2                      ((unsigned int)0x20000000)        /*!<DAC channel2 DMA underrun flag */

/******************************************************************************/
/*                                                                            */
/*                                 Debug MCU                                  */
/*                                                                            */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                                    DCMI                                    */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DCMI_CR register  ******************/
#define DCMI_CR_CAPTURE                      ((unsigned int)0x00000001)
#define DCMI_CR_CM                           ((unsigned int)0x00000002)
#define DCMI_CR_CROP                         ((unsigned int)0x00000004)
#define DCMI_CR_JPEG                         ((unsigned int)0x00000008)
#define DCMI_CR_ESS                          ((unsigned int)0x00000010)
#define DCMI_CR_PCKPOL                       ((unsigned int)0x00000020)
#define DCMI_CR_HSPOL                        ((unsigned int)0x00000040)
#define DCMI_CR_VSPOL                        ((unsigned int)0x00000080)
#define DCMI_CR_FCRC_0                       ((unsigned int)0x00000100)
#define DCMI_CR_FCRC_1                       ((unsigned int)0x00000200)
#define DCMI_CR_EDM_0                        ((unsigned int)0x00000400)
#define DCMI_CR_EDM_1                        ((unsigned int)0x00000800)
#define DCMI_CR_CRE                          ((unsigned int)0x00001000)
#define DCMI_CR_ENABLE                       ((unsigned int)0x00004000)

/********************  Bits definition for DCMI_SR register  ******************/
#define DCMI_SR_HSYNC                        ((unsigned int)0x00000001)
#define DCMI_SR_VSYNC                        ((unsigned int)0x00000002)
#define DCMI_SR_FNE                          ((unsigned int)0x00000004)

/********************  Bits definition for DCMI_RISR register  ****************/
#define DCMI_RISR_FRAME_RIS                  ((unsigned int)0x00000001)
#define DCMI_RISR_OVF_RIS                    ((unsigned int)0x00000002)
#define DCMI_RISR_ERR_RIS                    ((unsigned int)0x00000004)
#define DCMI_RISR_VSYNC_RIS                  ((unsigned int)0x00000008)
#define DCMI_RISR_LINE_RIS                   ((unsigned int)0x00000010)

/********************  Bits definition for DCMI_IER register  *****************/
#define DCMI_IER_FRAME_IE                    ((unsigned int)0x00000001)
#define DCMI_IER_OVF_IE                      ((unsigned int)0x00000002)
#define DCMI_IER_ERR_IE                      ((unsigned int)0x00000004)
#define DCMI_IER_VSYNC_IE                    ((unsigned int)0x00000008)
#define DCMI_IER_LINE_IE                     ((unsigned int)0x00000010)

/********************  Bits definition for DCMI_MISR register  ****************/
#define DCMI_MISR_FRAME_MIS                  ((unsigned int)0x00000001)
#define DCMI_MISR_OVF_MIS                    ((unsigned int)0x00000002)
#define DCMI_MISR_ERR_MIS                    ((unsigned int)0x00000004)
#define DCMI_MISR_VSYNC_MIS                  ((unsigned int)0x00000008)
#define DCMI_MISR_LINE_MIS                   ((unsigned int)0x00000010)

/********************  Bits definition for DCMI_ICR register  *****************/
#define DCMI_ICR_FRAME_ISC                   ((unsigned int)0x00000001)
#define DCMI_ICR_OVF_ISC                     ((unsigned int)0x00000002)
#define DCMI_ICR_ERR_ISC                     ((unsigned int)0x00000004)
#define DCMI_ICR_VSYNC_ISC                   ((unsigned int)0x00000008)
#define DCMI_ICR_LINE_ISC                    ((unsigned int)0x00000010)

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMA_SxCR register  *****************/ 
#define DMA_SxCR_CHSEL                       ((unsigned int)0x0E000000)
#define DMA_SxCR_CHSEL_0                     ((unsigned int)0x02000000)
#define DMA_SxCR_CHSEL_1                     ((unsigned int)0x04000000)
#define DMA_SxCR_CHSEL_2                     ((unsigned int)0x08000000) 
#define DMA_SxCR_MBURST                      ((unsigned int)0x01800000)
#define DMA_SxCR_MBURST_0                    ((unsigned int)0x00800000)
#define DMA_SxCR_MBURST_1                    ((unsigned int)0x01000000)
#define DMA_SxCR_PBURST                      ((unsigned int)0x00600000)
#define DMA_SxCR_PBURST_0                    ((unsigned int)0x00200000)
#define DMA_SxCR_PBURST_1                    ((unsigned int)0x00400000)
#define DMA_SxCR_ACK                         ((unsigned int)0x00100000)
#define DMA_SxCR_CT                          ((unsigned int)0x00080000)  
#define DMA_SxCR_DBM                         ((unsigned int)0x00040000)
#define DMA_SxCR_PL                          ((unsigned int)0x00030000)
#define DMA_SxCR_PL_0                        ((unsigned int)0x00010000)
#define DMA_SxCR_PL_1                        ((unsigned int)0x00020000)
#define DMA_SxCR_PINCOS                      ((unsigned int)0x00008000)
#define DMA_SxCR_MSIZE                       ((unsigned int)0x00006000)
#define DMA_SxCR_MSIZE_0                     ((unsigned int)0x00002000)
#define DMA_SxCR_MSIZE_1                     ((unsigned int)0x00004000)
#define DMA_SxCR_PSIZE                       ((unsigned int)0x00001800)
#define DMA_SxCR_PSIZE_0                     ((unsigned int)0x00000800)
#define DMA_SxCR_PSIZE_1                     ((unsigned int)0x00001000)
#define DMA_SxCR_MINC                        ((unsigned int)0x00000400)
#define DMA_SxCR_PINC                        ((unsigned int)0x00000200)
#define DMA_SxCR_CIRC                        ((unsigned int)0x00000100)
#define DMA_SxCR_DIR                         ((unsigned int)0x000000C0)
#define DMA_SxCR_DIR_0                       ((unsigned int)0x00000040)
#define DMA_SxCR_DIR_1                       ((unsigned int)0x00000080)
#define DMA_SxCR_PFCTRL                      ((unsigned int)0x00000020)
#define DMA_SxCR_TCIE                        ((unsigned int)0x00000010)
#define DMA_SxCR_HTIE                        ((unsigned int)0x00000008)
#define DMA_SxCR_TEIE                        ((unsigned int)0x00000004)
#define DMA_SxCR_DMEIE                       ((unsigned int)0x00000002)
#define DMA_SxCR_EN                          ((unsigned int)0x00000001)

/********************  Bits definition for DMA_SxCNDTR register  **************/
#define DMA_SxNDT                            ((unsigned int)0x0000FFFF)
#define DMA_SxNDT_0                          ((unsigned int)0x00000001)
#define DMA_SxNDT_1                          ((unsigned int)0x00000002)
#define DMA_SxNDT_2                          ((unsigned int)0x00000004)
#define DMA_SxNDT_3                          ((unsigned int)0x00000008)
#define DMA_SxNDT_4                          ((unsigned int)0x00000010)
#define DMA_SxNDT_5                          ((unsigned int)0x00000020)
#define DMA_SxNDT_6                          ((unsigned int)0x00000040)
#define DMA_SxNDT_7                          ((unsigned int)0x00000080)
#define DMA_SxNDT_8                          ((unsigned int)0x00000100)
#define DMA_SxNDT_9                          ((unsigned int)0x00000200)
#define DMA_SxNDT_10                         ((unsigned int)0x00000400)
#define DMA_SxNDT_11                         ((unsigned int)0x00000800)
#define DMA_SxNDT_12                         ((unsigned int)0x00001000)
#define DMA_SxNDT_13                         ((unsigned int)0x00002000)
#define DMA_SxNDT_14                         ((unsigned int)0x00004000)
#define DMA_SxNDT_15                         ((unsigned int)0x00008000)

/********************  Bits definition for DMA_SxFCR register  ****************/ 
#define DMA_SxFCR_FEIE                       ((unsigned int)0x00000080)
#define DMA_SxFCR_FS                         ((unsigned int)0x00000038)
#define DMA_SxFCR_FS_0                       ((unsigned int)0x00000008)
#define DMA_SxFCR_FS_1                       ((unsigned int)0x00000010)
#define DMA_SxFCR_FS_2                       ((unsigned int)0x00000020)
#define DMA_SxFCR_DMDIS                      ((unsigned int)0x00000004)
#define DMA_SxFCR_FTH                        ((unsigned int)0x00000003)
#define DMA_SxFCR_FTH_0                      ((unsigned int)0x00000001)
#define DMA_SxFCR_FTH_1                      ((unsigned int)0x00000002)

