raphui/rnk/include/stm32f429.h
#define DMA2D_CR_START                     ((unsigned int)0x00000001)               /*!< Start transfer */
#define DMA2D_CR_SUSP                      ((unsigned int)0x00000002)               /*!< Suspend transfer */
#define DMA2D_CR_ABORT                     ((unsigned int)0x00000004)               /*!< Abort transfer */
#define DMA2D_CR_TEIE                      ((unsigned int)0x00000100)               /*!< Transfer Error Interrupt Enable */
#define DMA2D_CR_TCIE                      ((unsigned int)0x00000200)               /*!< Transfer Complete Interrupt Enable */
#define DMA2D_CR_TWIE                      ((unsigned int)0x00000400)               /*!< Transfer Watermark Interrupt Enable */
#define DMA2D_CR_CAEIE                     ((unsigned int)0x00000800)               /*!< CLUT Access Error Interrupt Enable */
#define DMA2D_CR_CTCIE                     ((unsigned int)0x00001000)               /*!< CLUT Transfer Complete Interrupt Enable */
#define DMA2D_CR_CEIE                      ((unsigned int)0x00002000)               /*!< Configuration Error Interrupt Enable */
#define DMA2D_CR_MODE                      ((unsigned int)0x00030000)               /*!< DMA2D Mode */

/********************  Bit definition for DMA2D_ISR register  *****************/

#define DMA2D_ISR_TEIF                     ((unsigned int)0x00000001)               /*!< Transfer Error Interrupt Flag */
#define DMA2D_ISR_TCIF                     ((unsigned int)0x00000002)               /*!< Transfer Complete Interrupt Flag */
#define DMA2D_ISR_TWIF                     ((unsigned int)0x00000004)               /*!< Transfer Watermark Interrupt Flag */
#define DMA2D_ISR_CAEIF                    ((unsigned int)0x00000008)               /*!< CLUT Access Error Interrupt Flag */
#define DMA2D_ISR_CTCIF                    ((unsigned int)0x00000010)               /*!< CLUT Transfer Complete Interrupt Flag */
#define DMA2D_ISR_CEIF                     ((unsigned int)0x00000020)               /*!< Configuration Error Interrupt Flag */

/********************  Bit definition for DMA2D_IFSR register  ****************/

#define DMA2D_IFSR_CTEIF                   ((unsigned int)0x00000001)               /*!< Clears Transfer Error Interrupt Flag */
#define DMA2D_IFSR_CTCIF                   ((unsigned int)0x00000002)               /*!< Clears Transfer Complete Interrupt Flag */
#define DMA2D_IFSR_CTWIF                   ((unsigned int)0x00000004)               /*!< Clears Transfer Watermark Interrupt Flag */
#define DMA2D_IFSR_CCAEIF                  ((unsigned int)0x00000008)               /*!< Clears CLUT Access Error Interrupt Flag */
#define DMA2D_IFSR_CCTCIF                  ((unsigned int)0x00000010)               /*!< Clears CLUT Transfer Complete Interrupt Flag */
#define DMA2D_IFSR_CCEIF                   ((unsigned int)0x00000020)               /*!< Clears Configuration Error Interrupt Flag */

/********************  Bit definition for DMA2D_FGMAR register  ***************/

#define DMA2D_FGMAR_MA                     ((unsigned int)0xFFFFFFFF)               /*!< Memory Address */

/********************  Bit definition for DMA2D_FGOR register  ****************/

#define DMA2D_FGOR_LO                      ((unsigned int)0x00003FFF)               /*!< Line Offset */

/********************  Bit definition for DMA2D_BGMAR register  ***************/

#define DMA2D_BGMAR_MA                     ((unsigned int)0xFFFFFFFF)               /*!< Memory Address */

/********************  Bit definition for DMA2D_BGOR register  ****************/

#define DMA2D_BGOR_LO                      ((unsigned int)0x00003FFF)               /*!< Line Offset */

/********************  Bit definition for DMA2D_FGPFCCR register  *************/

#define DMA2D_FGPFCCR_CM                   ((unsigned int)0x0000000F)               /*!< Color mode */
#define DMA2D_FGPFCCR_CCM                  ((unsigned int)0x00000010)               /*!< CLUT Color mode */
#define DMA2D_FGPFCCR_START                ((unsigned int)0x00000020)               /*!< Start */
#define DMA2D_FGPFCCR_CS                   ((unsigned int)0x0000FF00)               /*!< CLUT size */
#define DMA2D_FGPFCCR_AM                   ((unsigned int)0x00030000)               /*!< Alpha mode */
#define DMA2D_FGPFCCR_ALPHA                ((unsigned int)0xFF000000)               /*!< Alpha value */

/********************  Bit definition for DMA2D_FGCOLR register  **************/

#define DMA2D_FGCOLR_BLUE                  ((unsigned int)0x000000FF)               /*!< Blue Value */
#define DMA2D_FGCOLR_GREEN                 ((unsigned int)0x0000FF00)               /*!< Green Value */
#define DMA2D_FGCOLR_RED                   ((unsigned int)0x00FF0000)               /*!< Red Value */   

/********************  Bit definition for DMA2D_BGPFCCR register  *************/

#define DMA2D_BGPFCCR_CM                   ((unsigned int)0x0000000F)               /*!< Color mode */
#define DMA2D_BGPFCCR_CCM                  ((unsigned int)0x00000010)               /*!< CLUT Color mode */
#define DMA2D_BGPFCCR_START                ((unsigned int)0x00000020)               /*!< Start */
#define DMA2D_BGPFCCR_CS                   ((unsigned int)0x0000FF00)               /*!< CLUT size */
#define DMA2D_BGPFCCR_AM                   ((unsigned int)0x00030000)               /*!< Alpha Mode */
#define DMA2D_BGPFCCR_ALPHA                ((unsigned int)0xFF000000)               /*!< Alpha value */

/********************  Bit definition for DMA2D_BGCOLR register  **************/

#define DMA2D_BGCOLR_BLUE                  ((unsigned int)0x000000FF)               /*!< Blue Value */
#define DMA2D_BGCOLR_GREEN                 ((unsigned int)0x0000FF00)               /*!< Green Value */
#define DMA2D_BGCOLR_RED                   ((unsigned int)0x00FF0000)               /*!< Red Value */

/********************  Bit definition for DMA2D_FGCMAR register  **************/

#define DMA2D_FGCMAR_MA                    ((unsigned int)0xFFFFFFFF)               /*!< Memory Address */

/********************  Bit definition for DMA2D_BGCMAR register  **************/

#define DMA2D_BGCMAR_MA                    ((unsigned int)0xFFFFFFFF)               /*!< Memory Address */

