raphui/rnk/include/stm32f429.h
/*******************  Bits definition for FLASH_CR register  ******************/
#define FLASH_CR_PG                          ((unsigned int)0x00000001)
#define FLASH_CR_SER                         ((unsigned int)0x00000002)
#define FLASH_CR_MER                         ((unsigned int)0x00000004)
#define FLASH_CR_MER1                        FLASH_CR_MER
#define FLASH_CR_SNB                         ((unsigned int)0x000000F8)
#define FLASH_CR_SNB_0                       ((unsigned int)0x00000008)
#define FLASH_CR_SNB_1                       ((unsigned int)0x00000010)
#define FLASH_CR_SNB_2                       ((unsigned int)0x00000020)
#define FLASH_CR_SNB_3                       ((unsigned int)0x00000040)
#define FLASH_CR_SNB_4                       ((unsigned int)0x00000040)
#define FLASH_CR_PSIZE                       ((unsigned int)0x00000300)
#define FLASH_CR_PSIZE_0                     ((unsigned int)0x00000100)
#define FLASH_CR_PSIZE_1                     ((unsigned int)0x00000200)
#define FLASH_CR_MER2                        ((unsigned int)0x00008000)
#define FLASH_CR_STRT                        ((unsigned int)0x00010000)
#define FLASH_CR_EOPIE                       ((unsigned int)0x01000000)
#define FLASH_CR_LOCK                        ((unsigned int)0x80000000)

/*******************  Bits definition for FLASH_OPTCR register  ***************/
#define FLASH_OPTCR_OPTLOCK                 ((unsigned int)0x00000001)
#define FLASH_OPTCR_OPTSTRT                 ((unsigned int)0x00000002)
#define FLASH_OPTCR_BOR_LEV_0               ((unsigned int)0x00000004)
#define FLASH_OPTCR_BOR_LEV_1               ((unsigned int)0x00000008)
#define FLASH_OPTCR_BOR_LEV                 ((unsigned int)0x0000000C)
#define FLASH_OPTCR_BFB2                    ((unsigned int)0x00000010)

#define FLASH_OPTCR_WDG_SW                  ((unsigned int)0x00000020)
#define FLASH_OPTCR_nRST_STOP               ((unsigned int)0x00000040)
#define FLASH_OPTCR_nRST_STDBY              ((unsigned int)0x00000080)
#define FLASH_OPTCR_RDP                     ((unsigned int)0x0000FF00)
#define FLASH_OPTCR_RDP_0                   ((unsigned int)0x00000100)
#define FLASH_OPTCR_RDP_1                   ((unsigned int)0x00000200)
#define FLASH_OPTCR_RDP_2                   ((unsigned int)0x00000400)
#define FLASH_OPTCR_RDP_3                   ((unsigned int)0x00000800)
#define FLASH_OPTCR_RDP_4                   ((unsigned int)0x00001000)
#define FLASH_OPTCR_RDP_5                   ((unsigned int)0x00002000)
#define FLASH_OPTCR_RDP_6                   ((unsigned int)0x00004000)
#define FLASH_OPTCR_RDP_7                   ((unsigned int)0x00008000)
#define FLASH_OPTCR_nWRP                    ((unsigned int)0x0FFF0000)
#define FLASH_OPTCR_nWRP_0                  ((unsigned int)0x00010000)
#define FLASH_OPTCR_nWRP_1                  ((unsigned int)0x00020000)
#define FLASH_OPTCR_nWRP_2                  ((unsigned int)0x00040000)
#define FLASH_OPTCR_nWRP_3                  ((unsigned int)0x00080000)
#define FLASH_OPTCR_nWRP_4                  ((unsigned int)0x00100000)
#define FLASH_OPTCR_nWRP_5                  ((unsigned int)0x00200000)
#define FLASH_OPTCR_nWRP_6                  ((unsigned int)0x00400000)
#define FLASH_OPTCR_nWRP_7                  ((unsigned int)0x00800000)
#define FLASH_OPTCR_nWRP_8                  ((unsigned int)0x01000000)
#define FLASH_OPTCR_nWRP_9                  ((unsigned int)0x02000000)
#define FLASH_OPTCR_nWRP_10                 ((unsigned int)0x04000000)
#define FLASH_OPTCR_nWRP_11                 ((unsigned int)0x08000000)

#define FLASH_OPTCR_DB1M                    ((unsigned int)0x40000000) 
#define FLASH_OPTCR_SPRMOD                  ((unsigned int)0x80000000) 

/******************  Bits definition for FLASH_OPTCR1 register  ***************/
#define FLASH_OPTCR1_nWRP                    ((unsigned int)0x0FFF0000)
#define FLASH_OPTCR1_nWRP_0                  ((unsigned int)0x00010000)
#define FLASH_OPTCR1_nWRP_1                  ((unsigned int)0x00020000)
#define FLASH_OPTCR1_nWRP_2                  ((unsigned int)0x00040000)
#define FLASH_OPTCR1_nWRP_3                  ((unsigned int)0x00080000)
#define FLASH_OPTCR1_nWRP_4                  ((unsigned int)0x00100000)
#define FLASH_OPTCR1_nWRP_5                  ((unsigned int)0x00200000)
#define FLASH_OPTCR1_nWRP_6                  ((unsigned int)0x00400000)
#define FLASH_OPTCR1_nWRP_7                  ((unsigned int)0x00800000)
#define FLASH_OPTCR1_nWRP_8                  ((unsigned int)0x01000000)
#define FLASH_OPTCR1_nWRP_9                  ((unsigned int)0x02000000)
#define FLASH_OPTCR1_nWRP_10                 ((unsigned int)0x04000000)
#define FLASH_OPTCR1_nWRP_11                 ((unsigned int)0x08000000)

/******************************************************************************/
/*                                                                            */
/*                          Flexible Memory Controller                        */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for FMC_BCR1 register  *******************/
#define  FMC_BCR1_MBKEN                     ((unsigned int)0x00000001)        /*!<Memory bank enable bit                 */
#define  FMC_BCR1_MUXEN                     ((unsigned int)0x00000002)        /*!<Address/data multiplexing enable bit   */

#define  FMC_BCR1_MTYP                      ((unsigned int)0x0000000C)        /*!<MTYP[1:0] bits (Memory type)           */
#define  FMC_BCR1_MTYP_0                    ((unsigned int)0x00000004)        /*!<Bit 0 */
#define  FMC_BCR1_MTYP_1                    ((unsigned int)0x00000008)        /*!<Bit 1 */

#define  FMC_BCR1_MWID                      ((unsigned int)0x00000030)        /*!<MWID[1:0] bits (Memory data bus width) */
#define  FMC_BCR1_MWID_0                    ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_BCR1_MWID_1                    ((unsigned int)0x00000020)        /*!<Bit 1 */

#define  FMC_BCR1_FACCEN                    ((unsigned int)0x00000040)        /*!<Flash access enable        */
#define  FMC_BCR1_BURSTEN                   ((unsigned int)0x00000100)        /*!<Burst enable bit           */
#define  FMC_BCR1_WAITPOL                   ((unsigned int)0x00000200)        /*!<Wait signal polarity bit   */
#define  FMC_BCR1_WRAPMOD                   ((unsigned int)0x00000400)        /*!<Wrapped burst mode support */
#define  FMC_BCR1_WAITCFG                   ((unsigned int)0x00000800)        /*!<Wait timing configuration  */
#define  FMC_BCR1_WREN                      ((unsigned int)0x00001000)        /*!<Write enable bit           */
#define  FMC_BCR1_WAITEN                    ((unsigned int)0x00002000)        /*!<Wait enable bit            */
#define  FMC_BCR1_EXTMOD                    ((unsigned int)0x00004000)        /*!<Extended mode enable       */
#define  FMC_BCR1_ASYNCWAIT                 ((unsigned int)0x00008000)        /*!<Asynchronous wait          */
#define  FMC_BCR1_CBURSTRW                  ((unsigned int)0x00080000)        /*!<Write burst enable         */
#define  FMC_BCR1_CCLKEN                    ((unsigned int)0x00100000)        /*!<Continous clock enable     */

