raphui/rnk/include/stm32f429.h
#define  FMC_BTR4_BUSTURN                   ((unsigned int)0x000F0000)        /*!<BUSTURN[3:0] bits (Bus turnaround phase duration) */
#define  FMC_BTR4_BUSTURN_0                 ((unsigned int)0x00010000)        /*!<Bit 0 */
#define  FMC_BTR4_BUSTURN_1                 ((unsigned int)0x00020000)        /*!<Bit 1 */
#define  FMC_BTR4_BUSTURN_2                 ((unsigned int)0x00040000)        /*!<Bit 2 */
#define  FMC_BTR4_BUSTURN_3                 ((unsigned int)0x00080000)        /*!<Bit 3 */

#define  FMC_BTR4_CLKDIV                    ((unsigned int)0x00F00000)        /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define  FMC_BTR4_CLKDIV_0                  ((unsigned int)0x00100000)        /*!<Bit 0 */
#define  FMC_BTR4_CLKDIV_1                  ((unsigned int)0x00200000)        /*!<Bit 1 */
#define  FMC_BTR4_CLKDIV_2                  ((unsigned int)0x00400000)        /*!<Bit 2 */
#define  FMC_BTR4_CLKDIV_3                  ((unsigned int)0x00800000)        /*!<Bit 3 */

#define  FMC_BTR4_DATLAT                    ((unsigned int)0x0F000000)        /*!<DATLA[3:0] bits (Data latency) */
#define  FMC_BTR4_DATLAT_0                  ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  FMC_BTR4_DATLAT_1                  ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  FMC_BTR4_DATLAT_2                  ((unsigned int)0x04000000)        /*!<Bit 2 */
#define  FMC_BTR4_DATLAT_3                  ((unsigned int)0x08000000)        /*!<Bit 3 */

#define  FMC_BTR4_ACCMOD                    ((unsigned int)0x30000000)        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BTR4_ACCMOD_0                  ((unsigned int)0x10000000)        /*!<Bit 0 */
#define  FMC_BTR4_ACCMOD_1                  ((unsigned int)0x20000000)        /*!<Bit 1 */

/******************  Bit definition for FMC_BWTR1 register  ******************/
#define  FMC_BWTR1_ADDSET                   ((unsigned int)0x0000000F)        /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define  FMC_BWTR1_ADDSET_0                 ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_BWTR1_ADDSET_1                 ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  FMC_BWTR1_ADDSET_2                 ((unsigned int)0x00000004)        /*!<Bit 2 */
#define  FMC_BWTR1_ADDSET_3                 ((unsigned int)0x00000008)        /*!<Bit 3 */

#define  FMC_BWTR1_ADDHLD                   ((unsigned int)0x000000F0)        /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define  FMC_BWTR1_ADDHLD_0                 ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_BWTR1_ADDHLD_1                 ((unsigned int)0x00000020)        /*!<Bit 1 */
#define  FMC_BWTR1_ADDHLD_2                 ((unsigned int)0x00000040)        /*!<Bit 2 */
#define  FMC_BWTR1_ADDHLD_3                 ((unsigned int)0x00000080)        /*!<Bit 3 */

#define  FMC_BWTR1_DATAST                   ((unsigned int)0x0000FF00)        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BWTR1_DATAST_0                 ((unsigned int)0x00000100)        /*!<Bit 0 */
#define  FMC_BWTR1_DATAST_1                 ((unsigned int)0x00000200)        /*!<Bit 1 */
#define  FMC_BWTR1_DATAST_2                 ((unsigned int)0x00000400)        /*!<Bit 2 */
#define  FMC_BWTR1_DATAST_3                 ((unsigned int)0x00000800)        /*!<Bit 3 */
#define  FMC_BWTR1_DATAST_4                 ((unsigned int)0x00001000)        /*!<Bit 4 */
#define  FMC_BWTR1_DATAST_5                 ((unsigned int)0x00002000)        /*!<Bit 5 */
#define  FMC_BWTR1_DATAST_6                 ((unsigned int)0x00004000)        /*!<Bit 6 */
#define  FMC_BWTR1_DATAST_7                 ((unsigned int)0x00008000)        /*!<Bit 7 */

#define  FMC_BWTR1_CLKDIV                   ((unsigned int)0x00F00000)        /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define  FMC_BWTR1_CLKDIV_0                 ((unsigned int)0x00100000)        /*!<Bit 0 */
#define  FMC_BWTR1_CLKDIV_1                 ((unsigned int)0x00200000)        /*!<Bit 1 */
#define  FMC_BWTR1_CLKDIV_2                 ((unsigned int)0x00400000)        /*!<Bit 2 */
#define  FMC_BWTR1_CLKDIV_3                 ((unsigned int)0x00800000)        /*!<Bit 3 */

#define  FMC_BWTR1_DATLAT                   ((unsigned int)0x0F000000)        /*!<DATLA[3:0] bits (Data latency) */
#define  FMC_BWTR1_DATLAT_0                 ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  FMC_BWTR1_DATLAT_1                 ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  FMC_BWTR1_DATLAT_2                 ((unsigned int)0x04000000)        /*!<Bit 2 */
#define  FMC_BWTR1_DATLAT_3                 ((unsigned int)0x08000000)        /*!<Bit 3 */

#define  FMC_BWTR1_ACCMOD                   ((unsigned int)0x30000000)        /*!<ACCMOD[1:0] bits (Access mode) */
#define  FMC_BWTR1_ACCMOD_0                 ((unsigned int)0x10000000)        /*!<Bit 0 */
#define  FMC_BWTR1_ACCMOD_1                 ((unsigned int)0x20000000)        /*!<Bit 1 */

/******************  Bit definition for FMC_BWTR2 register  ******************/
#define  FMC_BWTR2_ADDSET                   ((unsigned int)0x0000000F)        /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define  FMC_BWTR2_ADDSET_0                 ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_BWTR2_ADDSET_1                 ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  FMC_BWTR2_ADDSET_2                 ((unsigned int)0x00000004)        /*!<Bit 2 */
#define  FMC_BWTR2_ADDSET_3                 ((unsigned int)0x00000008)        /*!<Bit 3 */

#define  FMC_BWTR2_ADDHLD                   ((unsigned int)0x000000F0)        /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define  FMC_BWTR2_ADDHLD_0                 ((unsigned int)0x00000010)        /*!<Bit 0 */
#define  FMC_BWTR2_ADDHLD_1                 ((unsigned int)0x00000020)        /*!<Bit 1 */
#define  FMC_BWTR2_ADDHLD_2                 ((unsigned int)0x00000040)        /*!<Bit 2 */
#define  FMC_BWTR2_ADDHLD_3                 ((unsigned int)0x00000080)        /*!<Bit 3 */

#define  FMC_BWTR2_DATAST                   ((unsigned int)0x0000FF00)        /*!<DATAST [3:0] bits (Data-phase duration) */
#define  FMC_BWTR2_DATAST_0                 ((unsigned int)0x00000100)        /*!<Bit 0 */
#define  FMC_BWTR2_DATAST_1                 ((unsigned int)0x00000200)        /*!<Bit 1 */
#define  FMC_BWTR2_DATAST_2                 ((unsigned int)0x00000400)        /*!<Bit 2 */
#define  FMC_BWTR2_DATAST_3                 ((unsigned int)0x00000800)        /*!<Bit 3 */
#define  FMC_BWTR2_DATAST_4                 ((unsigned int)0x00001000)        /*!<Bit 4 */
#define  FMC_BWTR2_DATAST_5                 ((unsigned int)0x00002000)        /*!<Bit 5 */
#define  FMC_BWTR2_DATAST_6                 ((unsigned int)0x00004000)        /*!<Bit 6 */
#define  FMC_BWTR2_DATAST_7                 ((unsigned int)0x00008000)        /*!<Bit 7 */

