raphui/rnk/include/stm32f429.h
#define  FMC_SDTR2_TWR                      ((unsigned int)0x000F0000)        /*!<TRC[2:0] bits (Write recovery delay) */
#define  FMC_SDTR2_TWR_0                    ((unsigned int)0x00010000)        /*!<Bit 0 */
#define  FMC_SDTR2_TWR_1                    ((unsigned int)0x00020000)        /*!<Bit 1 */
#define  FMC_SDTR2_TWR_2                    ((unsigned int)0x00040000)        /*!<Bit 2 */

#define  FMC_SDTR2_TRP                      ((unsigned int)0x00F00000)        /*!<TRP[2:0] bits (Row precharge delay) */
#define  FMC_SDTR2_TRP_0                    ((unsigned int)0x00100000)        /*!<Bit 0 */
#define  FMC_SDTR2_TRP_1                    ((unsigned int)0x00200000)        /*!<Bit 1 */
#define  FMC_SDTR2_TRP_2                    ((unsigned int)0x00400000)        /*!<Bit 2 */

#define  FMC_SDTR2_TRCD                     ((unsigned int)0x0F000000)        /*!<TRP[2:0] bits (Row to column delay) */
#define  FMC_SDTR2_TRCD_0                   ((unsigned int)0x01000000)        /*!<Bit 0 */
#define  FMC_SDTR2_TRCD_1                   ((unsigned int)0x02000000)        /*!<Bit 1 */
#define  FMC_SDTR2_TRCD_2                   ((unsigned int)0x04000000)        /*!<Bit 2 */

/******************  Bit definition for FMC_SDCMR register  ******************/
#define  FMC_SDCMR_MODE                     ((unsigned int)0x00000007)        /*!<MODE[2:0] bits (Command mode) */
#define  FMC_SDCMR_MODE_0                   ((unsigned int)0x00000001)        /*!<Bit 0 */
#define  FMC_SDCMR_MODE_1                   ((unsigned int)0x00000002)        /*!<Bit 1 */
#define  FMC_SDCMR_MODE_2                   ((unsigned int)0x00000003)        /*!<Bit 2 */

#define  FMC_SDCMR_CTB2                     ((unsigned int)0x00000008)        /*!<Command target 2 */

#define  FMC_SDCMR_CTB1                     ((unsigned int)0x00000010)        /*!<Command target 1 */

#define  FMC_SDCMR_NRFS                     ((unsigned int)0x000001E0)        /*!<NRFS[3:0] bits (Number of auto-refresh) */
#define  FMC_SDCMR_NRFS_0                   ((unsigned int)0x00000020)        /*!<Bit 0 */
#define  FMC_SDCMR_NRFS_1                   ((unsigned int)0x00000040)        /*!<Bit 1 */
#define  FMC_SDCMR_NRFS_2                   ((unsigned int)0x00000080)        /*!<Bit 2 */
#define  FMC_SDCMR_NRFS_3                   ((unsigned int)0x00000100)        /*!<Bit 3 */

#define  FMC_SDCMR_MRD                      ((unsigned int)0x003FFE00)        /*!<MRD[12:0] bits (Mode register definition) */

/******************  Bit definition for FMC_SDRTR register  ******************/
#define  FMC_SDRTR_CRE                      ((unsigned int)0x00000001)        /*!<Clear refresh error flag */

#define  FMC_SDRTR_COUNT                    ((unsigned int)0x00003FFE)        /*!<COUNT[12:0] bits (Refresh timer count) */

#define  FMC_SDRTR_REIE                     ((unsigned int)0x00004000)        /*!<RES interupt enable */

/******************  Bit definition for FMC_SDSR register  ******************/
#define  FMC_SDSR_RE                        ((unsigned int)0x00000001)        /*!<Refresh error flag */

#define  FMC_SDSR_MODES1                    ((unsigned int)0x00000006)        /*!<MODES1[1:0]bits (Status mode for bank 1) */
#define  FMC_SDSR_MODES1_0                  ((unsigned int)0x00000002)        /*!<Bit 0 */
#define  FMC_SDSR_MODES1_1                  ((unsigned int)0x00000004)        /*!<Bit 1 */

#define  FMC_SDSR_MODES2                    ((unsigned int)0x00000018)        /*!<MODES2[1:0]bits (Status mode for bank 2) */
#define  FMC_SDSR_MODES2_0                  ((unsigned int)0x00000008)        /*!<Bit 0 */
#define  FMC_SDSR_MODES2_1                  ((unsigned int)0x00000010)        /*!<Bit 1 */

#define  FMC_SDSR_BUSY                      ((unsigned int)0x00000020)        /*!<Busy status */

/******************************************************************************/
/*                                                                            */
/*                            General Purpose I/O                             */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODER0                    ((unsigned int)0x00000003)
#define GPIO_MODER_MODER0_0                  ((unsigned int)0x00000001)
#define GPIO_MODER_MODER0_1                  ((unsigned int)0x00000002)

#define GPIO_MODER_MODER1                    ((unsigned int)0x0000000C)
#define GPIO_MODER_MODER1_0                  ((unsigned int)0x00000004)
#define GPIO_MODER_MODER1_1                  ((unsigned int)0x00000008)

#define GPIO_MODER_MODER2                    ((unsigned int)0x00000030)
#define GPIO_MODER_MODER2_0                  ((unsigned int)0x00000010)
#define GPIO_MODER_MODER2_1                  ((unsigned int)0x00000020)

#define GPIO_MODER_MODER3                    ((unsigned int)0x000000C0)
#define GPIO_MODER_MODER3_0                  ((unsigned int)0x00000040)
#define GPIO_MODER_MODER3_1                  ((unsigned int)0x00000080)

#define GPIO_MODER_MODER4                    ((unsigned int)0x00000300)
#define GPIO_MODER_MODER4_0                  ((unsigned int)0x00000100)
#define GPIO_MODER_MODER4_1                  ((unsigned int)0x00000200)

#define GPIO_MODER_MODER5                    ((unsigned int)0x00000C00)
#define GPIO_MODER_MODER5_0                  ((unsigned int)0x00000400)
#define GPIO_MODER_MODER5_1                  ((unsigned int)0x00000800)

#define GPIO_MODER_MODER6                    ((unsigned int)0x00003000)
#define GPIO_MODER_MODER6_0                  ((unsigned int)0x00001000)
#define GPIO_MODER_MODER6_1                  ((unsigned int)0x00002000)

#define GPIO_MODER_MODER7                    ((unsigned int)0x0000C000)
#define GPIO_MODER_MODER7_0                  ((unsigned int)0x00004000)
#define GPIO_MODER_MODER7_1                  ((unsigned int)0x00008000)

#define GPIO_MODER_MODER8                    ((unsigned int)0x00030000)
#define GPIO_MODER_MODER8_0                  ((unsigned int)0x00010000)
#define GPIO_MODER_MODER8_1                  ((unsigned int)0x00020000)

#define GPIO_MODER_MODER9                    ((unsigned int)0x000C0000)
#define GPIO_MODER_MODER9_0                  ((unsigned int)0x00040000)
#define GPIO_MODER_MODER9_1                  ((unsigned int)0x00080000)

#define GPIO_MODER_MODER10                   ((unsigned int)0x00300000)
#define GPIO_MODER_MODER10_0                 ((unsigned int)0x00100000)
#define GPIO_MODER_MODER10_1                 ((unsigned int)0x00200000)

#define GPIO_MODER_MODER11                   ((unsigned int)0x00C00000)
#define GPIO_MODER_MODER11_0                 ((unsigned int)0x00400000)
#define GPIO_MODER_MODER11_1                 ((unsigned int)0x00800000)

#define GPIO_MODER_MODER12                   ((unsigned int)0x03000000)
#define GPIO_MODER_MODER12_0                 ((unsigned int)0x01000000)
#define GPIO_MODER_MODER12_1                 ((unsigned int)0x02000000)

#define GPIO_MODER_MODER13                   ((unsigned int)0x0C000000)
#define GPIO_MODER_MODER13_0                 ((unsigned int)0x04000000)
#define GPIO_MODER_MODER13_1                 ((unsigned int)0x08000000)

