raphui/rnk/include/stm32f429.h
#define GPIO_MODER_MODER14                   ((unsigned int)0x30000000)
#define GPIO_MODER_MODER14_0                 ((unsigned int)0x10000000)
#define GPIO_MODER_MODER14_1                 ((unsigned int)0x20000000)

#define GPIO_MODER_MODER15                   ((unsigned int)0xC0000000)
#define GPIO_MODER_MODER15_0                 ((unsigned int)0x40000000)
#define GPIO_MODER_MODER15_1                 ((unsigned int)0x80000000)

/******************  Bits definition for GPIO_OTYPER register  ****************/
#define GPIO_OTYPER_OT_0                     ((unsigned int)0x00000001)
#define GPIO_OTYPER_OT_1                     ((unsigned int)0x00000002)
#define GPIO_OTYPER_OT_2                     ((unsigned int)0x00000004)
#define GPIO_OTYPER_OT_3                     ((unsigned int)0x00000008)
#define GPIO_OTYPER_OT_4                     ((unsigned int)0x00000010)
#define GPIO_OTYPER_OT_5                     ((unsigned int)0x00000020)
#define GPIO_OTYPER_OT_6                     ((unsigned int)0x00000040)
#define GPIO_OTYPER_OT_7                     ((unsigned int)0x00000080)
#define GPIO_OTYPER_OT_8                     ((unsigned int)0x00000100)
#define GPIO_OTYPER_OT_9                     ((unsigned int)0x00000200)
#define GPIO_OTYPER_OT_10                    ((unsigned int)0x00000400)
#define GPIO_OTYPER_OT_11                    ((unsigned int)0x00000800)
#define GPIO_OTYPER_OT_12                    ((unsigned int)0x00001000)
#define GPIO_OTYPER_OT_13                    ((unsigned int)0x00002000)
#define GPIO_OTYPER_OT_14                    ((unsigned int)0x00004000)
#define GPIO_OTYPER_OT_15                    ((unsigned int)0x00008000)

/******************  Bits definition for GPIO_OSPEEDR register  ***************/
#define GPIO_OSPEEDER_OSPEEDR0               ((unsigned int)0x00000003)
#define GPIO_OSPEEDER_OSPEEDR0_0             ((unsigned int)0x00000001)
#define GPIO_OSPEEDER_OSPEEDR0_1             ((unsigned int)0x00000002)

#define GPIO_OSPEEDER_OSPEEDR1               ((unsigned int)0x0000000C)
#define GPIO_OSPEEDER_OSPEEDR1_0             ((unsigned int)0x00000004)
#define GPIO_OSPEEDER_OSPEEDR1_1             ((unsigned int)0x00000008)

#define GPIO_OSPEEDER_OSPEEDR2               ((unsigned int)0x00000030)
#define GPIO_OSPEEDER_OSPEEDR2_0             ((unsigned int)0x00000010)
#define GPIO_OSPEEDER_OSPEEDR2_1             ((unsigned int)0x00000020)

#define GPIO_OSPEEDER_OSPEEDR3               ((unsigned int)0x000000C0)
#define GPIO_OSPEEDER_OSPEEDR3_0             ((unsigned int)0x00000040)
#define GPIO_OSPEEDER_OSPEEDR3_1             ((unsigned int)0x00000080)

#define GPIO_OSPEEDER_OSPEEDR4               ((unsigned int)0x00000300)
#define GPIO_OSPEEDER_OSPEEDR4_0             ((unsigned int)0x00000100)
#define GPIO_OSPEEDER_OSPEEDR4_1             ((unsigned int)0x00000200)

#define GPIO_OSPEEDER_OSPEEDR5               ((unsigned int)0x00000C00)
#define GPIO_OSPEEDER_OSPEEDR5_0             ((unsigned int)0x00000400)
#define GPIO_OSPEEDER_OSPEEDR5_1             ((unsigned int)0x00000800)

#define GPIO_OSPEEDER_OSPEEDR6               ((unsigned int)0x00003000)
#define GPIO_OSPEEDER_OSPEEDR6_0             ((unsigned int)0x00001000)
#define GPIO_OSPEEDER_OSPEEDR6_1             ((unsigned int)0x00002000)

#define GPIO_OSPEEDER_OSPEEDR7               ((unsigned int)0x0000C000)
#define GPIO_OSPEEDER_OSPEEDR7_0             ((unsigned int)0x00004000)
#define GPIO_OSPEEDER_OSPEEDR7_1             ((unsigned int)0x00008000)

#define GPIO_OSPEEDER_OSPEEDR8               ((unsigned int)0x00030000)
#define GPIO_OSPEEDER_OSPEEDR8_0             ((unsigned int)0x00010000)
#define GPIO_OSPEEDER_OSPEEDR8_1             ((unsigned int)0x00020000)

#define GPIO_OSPEEDER_OSPEEDR9               ((unsigned int)0x000C0000)
#define GPIO_OSPEEDER_OSPEEDR9_0             ((unsigned int)0x00040000)
#define GPIO_OSPEEDER_OSPEEDR9_1             ((unsigned int)0x00080000)

#define GPIO_OSPEEDER_OSPEEDR10              ((unsigned int)0x00300000)
#define GPIO_OSPEEDER_OSPEEDR10_0            ((unsigned int)0x00100000)
#define GPIO_OSPEEDER_OSPEEDR10_1            ((unsigned int)0x00200000)

#define GPIO_OSPEEDER_OSPEEDR11              ((unsigned int)0x00C00000)
#define GPIO_OSPEEDER_OSPEEDR11_0            ((unsigned int)0x00400000)
#define GPIO_OSPEEDER_OSPEEDR11_1            ((unsigned int)0x00800000)

#define GPIO_OSPEEDER_OSPEEDR12              ((unsigned int)0x03000000)
#define GPIO_OSPEEDER_OSPEEDR12_0            ((unsigned int)0x01000000)
#define GPIO_OSPEEDER_OSPEEDR12_1            ((unsigned int)0x02000000)

#define GPIO_OSPEEDER_OSPEEDR13              ((unsigned int)0x0C000000)
#define GPIO_OSPEEDER_OSPEEDR13_0            ((unsigned int)0x04000000)
#define GPIO_OSPEEDER_OSPEEDR13_1            ((unsigned int)0x08000000)

#define GPIO_OSPEEDER_OSPEEDR14              ((unsigned int)0x30000000)
#define GPIO_OSPEEDER_OSPEEDR14_0            ((unsigned int)0x10000000)
#define GPIO_OSPEEDER_OSPEEDR14_1            ((unsigned int)0x20000000)

#define GPIO_OSPEEDER_OSPEEDR15              ((unsigned int)0xC0000000)
#define GPIO_OSPEEDER_OSPEEDR15_0            ((unsigned int)0x40000000)
#define GPIO_OSPEEDER_OSPEEDR15_1            ((unsigned int)0x80000000)

/******************  Bits definition for GPIO_PUPDR register  *****************/
#define GPIO_PUPDR_PUPDR0                    ((unsigned int)0x00000003)
#define GPIO_PUPDR_PUPDR0_0                  ((unsigned int)0x00000001)
#define GPIO_PUPDR_PUPDR0_1                  ((unsigned int)0x00000002)

#define GPIO_PUPDR_PUPDR1                    ((unsigned int)0x0000000C)
#define GPIO_PUPDR_PUPDR1_0                  ((unsigned int)0x00000004)
#define GPIO_PUPDR_PUPDR1_1                  ((unsigned int)0x00000008)

#define GPIO_PUPDR_PUPDR2                    ((unsigned int)0x00000030)
#define GPIO_PUPDR_PUPDR2_0                  ((unsigned int)0x00000010)
#define GPIO_PUPDR_PUPDR2_1                  ((unsigned int)0x00000020)

#define GPIO_PUPDR_PUPDR3                    ((unsigned int)0x000000C0)
#define GPIO_PUPDR_PUPDR3_0                  ((unsigned int)0x00000040)
#define GPIO_PUPDR_PUPDR3_1                  ((unsigned int)0x00000080)

#define GPIO_PUPDR_PUPDR4                    ((unsigned int)0x00000300)
#define GPIO_PUPDR_PUPDR4_0                  ((unsigned int)0x00000100)
#define GPIO_PUPDR_PUPDR4_1                  ((unsigned int)0x00000200)

#define GPIO_PUPDR_PUPDR5                    ((unsigned int)0x00000C00)
#define GPIO_PUPDR_PUPDR5_0                  ((unsigned int)0x00000400)
#define GPIO_PUPDR_PUPDR5_1                  ((unsigned int)0x00000800)

#define GPIO_PUPDR_PUPDR6                    ((unsigned int)0x00003000)
#define GPIO_PUPDR_PUPDR6_0                  ((unsigned int)0x00001000)
#define GPIO_PUPDR_PUPDR6_1                  ((unsigned int)0x00002000)

