raphui/rnk/include/stm32f429.h
#define GPIO_PUPDR_PUPDR7                    ((unsigned int)0x0000C000)
#define GPIO_PUPDR_PUPDR7_0                  ((unsigned int)0x00004000)
#define GPIO_PUPDR_PUPDR7_1                  ((unsigned int)0x00008000)

#define GPIO_PUPDR_PUPDR8                    ((unsigned int)0x00030000)
#define GPIO_PUPDR_PUPDR8_0                  ((unsigned int)0x00010000)
#define GPIO_PUPDR_PUPDR8_1                  ((unsigned int)0x00020000)

#define GPIO_PUPDR_PUPDR9                    ((unsigned int)0x000C0000)
#define GPIO_PUPDR_PUPDR9_0                  ((unsigned int)0x00040000)
#define GPIO_PUPDR_PUPDR9_1                  ((unsigned int)0x00080000)

#define GPIO_PUPDR_PUPDR10                   ((unsigned int)0x00300000)
#define GPIO_PUPDR_PUPDR10_0                 ((unsigned int)0x00100000)
#define GPIO_PUPDR_PUPDR10_1                 ((unsigned int)0x00200000)

#define GPIO_PUPDR_PUPDR11                   ((unsigned int)0x00C00000)
#define GPIO_PUPDR_PUPDR11_0                 ((unsigned int)0x00400000)
#define GPIO_PUPDR_PUPDR11_1                 ((unsigned int)0x00800000)

#define GPIO_PUPDR_PUPDR12                   ((unsigned int)0x03000000)
#define GPIO_PUPDR_PUPDR12_0                 ((unsigned int)0x01000000)
#define GPIO_PUPDR_PUPDR12_1                 ((unsigned int)0x02000000)

#define GPIO_PUPDR_PUPDR13                   ((unsigned int)0x0C000000)
#define GPIO_PUPDR_PUPDR13_0                 ((unsigned int)0x04000000)
#define GPIO_PUPDR_PUPDR13_1                 ((unsigned int)0x08000000)

#define GPIO_PUPDR_PUPDR14                   ((unsigned int)0x30000000)
#define GPIO_PUPDR_PUPDR14_0                 ((unsigned int)0x10000000)
#define GPIO_PUPDR_PUPDR14_1                 ((unsigned int)0x20000000)

#define GPIO_PUPDR_PUPDR15                   ((unsigned int)0xC0000000)
#define GPIO_PUPDR_PUPDR15_0                 ((unsigned int)0x40000000)
#define GPIO_PUPDR_PUPDR15_1                 ((unsigned int)0x80000000)

/******************  Bits definition for GPIO_IDR register  *******************/
#define GPIO_IDR_IDR_0                       ((unsigned int)0x00000001)
#define GPIO_IDR_IDR_1                       ((unsigned int)0x00000002)
#define GPIO_IDR_IDR_2                       ((unsigned int)0x00000004)
#define GPIO_IDR_IDR_3                       ((unsigned int)0x00000008)
#define GPIO_IDR_IDR_4                       ((unsigned int)0x00000010)
#define GPIO_IDR_IDR_5                       ((unsigned int)0x00000020)
#define GPIO_IDR_IDR_6                       ((unsigned int)0x00000040)
#define GPIO_IDR_IDR_7                       ((unsigned int)0x00000080)
#define GPIO_IDR_IDR_8                       ((unsigned int)0x00000100)
#define GPIO_IDR_IDR_9                       ((unsigned int)0x00000200)
#define GPIO_IDR_IDR_10                      ((unsigned int)0x00000400)
#define GPIO_IDR_IDR_11                      ((unsigned int)0x00000800)
#define GPIO_IDR_IDR_12                      ((unsigned int)0x00001000)
#define GPIO_IDR_IDR_13                      ((unsigned int)0x00002000)
#define GPIO_IDR_IDR_14                      ((unsigned int)0x00004000)
#define GPIO_IDR_IDR_15                      ((unsigned int)0x00008000)
/* Old GPIO_IDR register bits definition, maintained for legacy purpose */
#define GPIO_OTYPER_IDR_0                    GPIO_IDR_IDR_0
#define GPIO_OTYPER_IDR_1                    GPIO_IDR_IDR_1
#define GPIO_OTYPER_IDR_2                    GPIO_IDR_IDR_2
#define GPIO_OTYPER_IDR_3                    GPIO_IDR_IDR_3
#define GPIO_OTYPER_IDR_4                    GPIO_IDR_IDR_4
#define GPIO_OTYPER_IDR_5                    GPIO_IDR_IDR_5
#define GPIO_OTYPER_IDR_6                    GPIO_IDR_IDR_6
#define GPIO_OTYPER_IDR_7                    GPIO_IDR_IDR_7
#define GPIO_OTYPER_IDR_8                    GPIO_IDR_IDR_8
#define GPIO_OTYPER_IDR_9                    GPIO_IDR_IDR_9
#define GPIO_OTYPER_IDR_10                   GPIO_IDR_IDR_10
#define GPIO_OTYPER_IDR_11                   GPIO_IDR_IDR_11
#define GPIO_OTYPER_IDR_12                   GPIO_IDR_IDR_12
#define GPIO_OTYPER_IDR_13                   GPIO_IDR_IDR_13
#define GPIO_OTYPER_IDR_14                   GPIO_IDR_IDR_14
#define GPIO_OTYPER_IDR_15                   GPIO_IDR_IDR_15

/******************  Bits definition for GPIO_ODR register  *******************/
#define GPIO_ODR_ODR_0                       ((unsigned int)0x00000001)
#define GPIO_ODR_ODR_1                       ((unsigned int)0x00000002)
#define GPIO_ODR_ODR_2                       ((unsigned int)0x00000004)
#define GPIO_ODR_ODR_3                       ((unsigned int)0x00000008)
#define GPIO_ODR_ODR_4                       ((unsigned int)0x00000010)
#define GPIO_ODR_ODR_5                       ((unsigned int)0x00000020)
#define GPIO_ODR_ODR_6                       ((unsigned int)0x00000040)
#define GPIO_ODR_ODR_7                       ((unsigned int)0x00000080)
#define GPIO_ODR_ODR_8                       ((unsigned int)0x00000100)
#define GPIO_ODR_ODR_9                       ((unsigned int)0x00000200)
#define GPIO_ODR_ODR_10                      ((unsigned int)0x00000400)
#define GPIO_ODR_ODR_11                      ((unsigned int)0x00000800)
#define GPIO_ODR_ODR_12                      ((unsigned int)0x00001000)
#define GPIO_ODR_ODR_13                      ((unsigned int)0x00002000)
#define GPIO_ODR_ODR_14                      ((unsigned int)0x00004000)
#define GPIO_ODR_ODR_15                      ((unsigned int)0x00008000)
/* Old GPIO_ODR register bits definition, maintained for legacy purpose */
#define GPIO_OTYPER_ODR_0                    GPIO_ODR_ODR_0
#define GPIO_OTYPER_ODR_1                    GPIO_ODR_ODR_1
#define GPIO_OTYPER_ODR_2                    GPIO_ODR_ODR_2
#define GPIO_OTYPER_ODR_3                    GPIO_ODR_ODR_3
#define GPIO_OTYPER_ODR_4                    GPIO_ODR_ODR_4
#define GPIO_OTYPER_ODR_5                    GPIO_ODR_ODR_5
#define GPIO_OTYPER_ODR_6                    GPIO_ODR_ODR_6
#define GPIO_OTYPER_ODR_7                    GPIO_ODR_ODR_7
#define GPIO_OTYPER_ODR_8                    GPIO_ODR_ODR_8
#define GPIO_OTYPER_ODR_9                    GPIO_ODR_ODR_9
#define GPIO_OTYPER_ODR_10                   GPIO_ODR_ODR_10
#define GPIO_OTYPER_ODR_11                   GPIO_ODR_ODR_11
#define GPIO_OTYPER_ODR_12                   GPIO_ODR_ODR_12
#define GPIO_OTYPER_ODR_13                   GPIO_ODR_ODR_13
#define GPIO_OTYPER_ODR_14                   GPIO_ODR_ODR_14
#define GPIO_OTYPER_ODR_15                   GPIO_ODR_ODR_15

/******************  Bits definition for GPIO_BSRR register  ******************/
#define GPIO_BSRR_BS_0                       ((unsigned int)0x00000001)
#define GPIO_BSRR_BS_1                       ((unsigned int)0x00000002)
#define GPIO_BSRR_BS_2                       ((unsigned int)0x00000004)
#define GPIO_BSRR_BS_3                       ((unsigned int)0x00000008)
#define GPIO_BSRR_BS_4                       ((unsigned int)0x00000010)
#define GPIO_BSRR_BS_5                       ((unsigned int)0x00000020)
#define GPIO_BSRR_BS_6                       ((unsigned int)0x00000040)
#define GPIO_BSRR_BS_7                       ((unsigned int)0x00000080)
#define GPIO_BSRR_BS_8                       ((unsigned int)0x00000100)
#define GPIO_BSRR_BS_9                       ((unsigned int)0x00000200)
#define GPIO_BSRR_BS_10                      ((unsigned int)0x00000400)
#define GPIO_BSRR_BS_11                      ((unsigned int)0x00000800)
#define GPIO_BSRR_BS_12                      ((unsigned int)0x00001000)
#define GPIO_BSRR_BS_13                      ((unsigned int)0x00002000)
#define GPIO_BSRR_BS_14                      ((unsigned int)0x00004000)
#define GPIO_BSRR_BS_15                      ((unsigned int)0x00008000)
#define GPIO_BSRR_BR_0                       ((unsigned int)0x00010000)
#define GPIO_BSRR_BR_1                       ((unsigned int)0x00020000)
#define GPIO_BSRR_BR_2                       ((unsigned int)0x00040000)
#define GPIO_BSRR_BR_3                       ((unsigned int)0x00080000)
#define GPIO_BSRR_BR_4                       ((unsigned int)0x00100000)
#define GPIO_BSRR_BR_5                       ((unsigned int)0x00200000)
#define GPIO_BSRR_BR_6                       ((unsigned int)0x00400000)
#define GPIO_BSRR_BR_7                       ((unsigned int)0x00800000)
#define GPIO_BSRR_BR_8                       ((unsigned int)0x01000000)
#define GPIO_BSRR_BR_9                       ((unsigned int)0x02000000)
#define GPIO_BSRR_BR_10                      ((unsigned int)0x04000000)
#define GPIO_BSRR_BR_11                      ((unsigned int)0x08000000)
#define GPIO_BSRR_BR_12                      ((unsigned int)0x10000000)
#define GPIO_BSRR_BR_13                      ((unsigned int)0x20000000)
#define GPIO_BSRR_BR_14                      ((unsigned int)0x40000000)
#define GPIO_BSRR_BR_15                      ((unsigned int)0x80000000)

/******************************************************************************/
/*                                                                            */
/*                                    HASH                                    */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for HASH_CR register  ********************/
#define HASH_CR_INIT                         ((unsigned int)0x00000004)
#define HASH_CR_DMAE                         ((unsigned int)0x00000008)
#define HASH_CR_DATATYPE                     ((unsigned int)0x00000030)
#define HASH_CR_DATATYPE_0                   ((unsigned int)0x00000010)
#define HASH_CR_DATATYPE_1                   ((unsigned int)0x00000020)
#define HASH_CR_MODE                         ((unsigned int)0x00000040)
#define HASH_CR_ALGO                         ((unsigned int)0x00040080)
#define HASH_CR_ALGO_0                       ((unsigned int)0x00000080)
#define HASH_CR_ALGO_1                       ((unsigned int)0x00040000)
#define HASH_CR_NBW                          ((unsigned int)0x00000F00)
#define HASH_CR_NBW_0                        ((unsigned int)0x00000100)
#define HASH_CR_NBW_1                        ((unsigned int)0x00000200)
#define HASH_CR_NBW_2                        ((unsigned int)0x00000400)
#define HASH_CR_NBW_3                        ((unsigned int)0x00000800)
#define HASH_CR_DINNE                        ((unsigned int)0x00001000)
#define HASH_CR_MDMAT                        ((unsigned int)0x00002000)
#define HASH_CR_LKEY                         ((unsigned int)0x00010000)

