raphui/rnk/include/stm32f429.h
#define  RCC_PLLCFGR_PLLN                     ((unsigned int)0x00007FC0)
#define  RCC_PLLCFGR_PLLN_0                   ((unsigned int)0x00000040)
#define  RCC_PLLCFGR_PLLN_1                   ((unsigned int)0x00000080)
#define  RCC_PLLCFGR_PLLN_2                   ((unsigned int)0x00000100)
#define  RCC_PLLCFGR_PLLN_3                   ((unsigned int)0x00000200)
#define  RCC_PLLCFGR_PLLN_4                   ((unsigned int)0x00000400)
#define  RCC_PLLCFGR_PLLN_5                   ((unsigned int)0x00000800)
#define  RCC_PLLCFGR_PLLN_6                   ((unsigned int)0x00001000)
#define  RCC_PLLCFGR_PLLN_7                   ((unsigned int)0x00002000)
#define  RCC_PLLCFGR_PLLN_8                   ((unsigned int)0x00004000)

#define  RCC_PLLCFGR_PLLP                    ((unsigned int)0x00030000)
#define  RCC_PLLCFGR_PLLP_0                  ((unsigned int)0x00010000)
#define  RCC_PLLCFGR_PLLP_1                  ((unsigned int)0x00020000)

#define  RCC_PLLCFGR_PLLSRC                  ((unsigned int)0x00400000)
#define  RCC_PLLCFGR_PLLSRC_HSE              ((unsigned int)0x00400000)
#define  RCC_PLLCFGR_PLLSRC_HSI              ((unsigned int)0x00000000)

#define  RCC_PLLCFGR_PLLQ                    ((unsigned int)0x0F000000)
#define  RCC_PLLCFGR_PLLQ_0                  ((unsigned int)0x01000000)
#define  RCC_PLLCFGR_PLLQ_1                  ((unsigned int)0x02000000)
#define  RCC_PLLCFGR_PLLQ_2                  ((unsigned int)0x04000000)
#define  RCC_PLLCFGR_PLLQ_3                  ((unsigned int)0x08000000)


/********************  Bit definition for RCC_CFGR register  ******************/
/*!< SW configuration */
#define  RCC_CFGR_SW                         ((unsigned int)0x00000003)        /*!< SW[1:0] bits (System clock Switch) */
#define  RCC_CFGR_SW_0                       ((unsigned int)0x00000001)        /*!< Bit 0 */
#define  RCC_CFGR_SW_1                       ((unsigned int)0x00000002)        /*!< Bit 1 */

#define  RCC_CFGR_SW_HSI                     ((unsigned int)0x00000000)        /*!< HSI selected as system clock */
#define  RCC_CFGR_SW_HSE                     ((unsigned int)0x00000001)        /*!< HSE selected as system clock */
#define  RCC_CFGR_SW_PLL                     ((unsigned int)0x00000002)        /*!< PLL/PLLP selected as system clock */

/*!< SWS configuration */
#define  RCC_CFGR_SWS                        ((unsigned int)0x0000000C)        /*!< SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_CFGR_SWS_0                      ((unsigned int)0x00000004)        /*!< Bit 0 */
#define  RCC_CFGR_SWS_1                      ((unsigned int)0x00000008)        /*!< Bit 1 */

#define  RCC_CFGR_SWS_HSI                    ((unsigned int)0x00000000)        /*!< HSI oscillator used as system clock */
#define  RCC_CFGR_SWS_HSE                    ((unsigned int)0x00000004)        /*!< HSE oscillator used as system clock */
#define  RCC_CFGR_SWS_PLL                    ((unsigned int)0x00000008)        /*!< PLL/PLLP used as system clock       */

/*!< HPRE configuration */
#define  RCC_CFGR_HPRE                       ((unsigned int)0x000000F0)        /*!< HPRE[3:0] bits (AHB prescaler) */
#define  RCC_CFGR_HPRE_0                     ((unsigned int)0x00000010)        /*!< Bit 0 */
#define  RCC_CFGR_HPRE_1                     ((unsigned int)0x00000020)        /*!< Bit 1 */
#define  RCC_CFGR_HPRE_2                     ((unsigned int)0x00000040)        /*!< Bit 2 */
#define  RCC_CFGR_HPRE_3                     ((unsigned int)0x00000080)        /*!< Bit 3 */

#define  RCC_CFGR_HPRE_DIV1                  ((unsigned int)0x00000000)        /*!< SYSCLK not divided */
#define  RCC_CFGR_HPRE_DIV2                  ((unsigned int)0x00000080)        /*!< SYSCLK divided by 2 */
#define  RCC_CFGR_HPRE_DIV4                  ((unsigned int)0x00000090)        /*!< SYSCLK divided by 4 */
#define  RCC_CFGR_HPRE_DIV8                  ((unsigned int)0x000000A0)        /*!< SYSCLK divided by 8 */
#define  RCC_CFGR_HPRE_DIV16                 ((unsigned int)0x000000B0)        /*!< SYSCLK divided by 16 */
#define  RCC_CFGR_HPRE_DIV64                 ((unsigned int)0x000000C0)        /*!< SYSCLK divided by 64 */
#define  RCC_CFGR_HPRE_DIV128                ((unsigned int)0x000000D0)        /*!< SYSCLK divided by 128 */
#define  RCC_CFGR_HPRE_DIV256                ((unsigned int)0x000000E0)        /*!< SYSCLK divided by 256 */
#define  RCC_CFGR_HPRE_DIV512                ((unsigned int)0x000000F0)        /*!< SYSCLK divided by 512 */

/*!< PPRE1 configuration */
#define  RCC_CFGR_PPRE1                      ((unsigned int)0x00001C00)        /*!< PRE1[2:0] bits (APB1 prescaler) */
#define  RCC_CFGR_PPRE1_0                    ((unsigned int)0x00000400)        /*!< Bit 0 */
#define  RCC_CFGR_PPRE1_1                    ((unsigned int)0x00000800)        /*!< Bit 1 */
#define  RCC_CFGR_PPRE1_2                    ((unsigned int)0x00001000)        /*!< Bit 2 */

#define  RCC_CFGR_PPRE1_DIV1                 ((unsigned int)0x00000000)        /*!< HCLK not divided */
#define  RCC_CFGR_PPRE1_DIV2                 ((unsigned int)0x00001000)        /*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE1_DIV4                 ((unsigned int)0x00001400)        /*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE1_DIV8                 ((unsigned int)0x00001800)        /*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE1_DIV16                ((unsigned int)0x00001C00)        /*!< HCLK divided by 16 */

/*!< PPRE2 configuration */
#define  RCC_CFGR_PPRE2                      ((unsigned int)0x0000E000)        /*!< PRE2[2:0] bits (APB2 prescaler) */
#define  RCC_CFGR_PPRE2_0                    ((unsigned int)0x00002000)        /*!< Bit 0 */
#define  RCC_CFGR_PPRE2_1                    ((unsigned int)0x00004000)        /*!< Bit 1 */
#define  RCC_CFGR_PPRE2_2                    ((unsigned int)0x00008000)        /*!< Bit 2 */

#define  RCC_CFGR_PPRE2_DIV1                 ((unsigned int)0x00000000)        /*!< HCLK not divided */
#define  RCC_CFGR_PPRE2_DIV2                 ((unsigned int)0x00008000)        /*!< HCLK divided by 2 */
#define  RCC_CFGR_PPRE2_DIV4                 ((unsigned int)0x0000A000)        /*!< HCLK divided by 4 */
#define  RCC_CFGR_PPRE2_DIV8                 ((unsigned int)0x0000C000)        /*!< HCLK divided by 8 */
#define  RCC_CFGR_PPRE2_DIV16                ((unsigned int)0x0000E000)        /*!< HCLK divided by 16 */

