raphui/rnk/include/stm32f429.h
/********************  Bit definition for RCC_APB1LPENR register  *************/
#define  RCC_APB1LPENR_TIM2LPEN              ((unsigned int)0x00000001)
#define  RCC_APB1LPENR_TIM3LPEN              ((unsigned int)0x00000002)
#define  RCC_APB1LPENR_TIM4LPEN              ((unsigned int)0x00000004)
#define  RCC_APB1LPENR_TIM5LPEN              ((unsigned int)0x00000008)
#define  RCC_APB1LPENR_TIM6LPEN              ((unsigned int)0x00000010)
#define  RCC_APB1LPENR_TIM7LPEN              ((unsigned int)0x00000020)
#define  RCC_APB1LPENR_TIM12LPEN             ((unsigned int)0x00000040)
#define  RCC_APB1LPENR_TIM13LPEN             ((unsigned int)0x00000080)
#define  RCC_APB1LPENR_TIM14LPEN             ((unsigned int)0x00000100)
#define  RCC_APB1LPENR_WWDGLPEN              ((unsigned int)0x00000800)
#define  RCC_APB1LPENR_SPI2LPEN              ((unsigned int)0x00004000)
#define  RCC_APB1LPENR_SPI3LPEN              ((unsigned int)0x00008000)
#define  RCC_APB1LPENR_USART2LPEN            ((unsigned int)0x00020000)
#define  RCC_APB1LPENR_USART3LPEN            ((unsigned int)0x00040000)
#define  RCC_APB1LPENR_UART4LPEN             ((unsigned int)0x00080000)
#define  RCC_APB1LPENR_UART5LPEN             ((unsigned int)0x00100000)
#define  RCC_APB1LPENR_I2C1LPEN              ((unsigned int)0x00200000)
#define  RCC_APB1LPENR_I2C2LPEN              ((unsigned int)0x00400000)
#define  RCC_APB1LPENR_I2C3LPEN              ((unsigned int)0x00800000)
#define  RCC_APB1LPENR_CAN1LPEN              ((unsigned int)0x02000000)
#define  RCC_APB1LPENR_CAN2LPEN              ((unsigned int)0x04000000)
#define  RCC_APB1LPENR_PWRLPEN               ((unsigned int)0x10000000)
#define  RCC_APB1LPENR_DACLPEN               ((unsigned int)0x20000000)
#define  RCC_APB1LPENR_UART7LPEN             ((unsigned int)0x40000000)
#define  RCC_APB1LPENR_UART8LPEN             ((unsigned int)0x80000000)

/********************  Bit definition for RCC_APB2LPENR register  *************/
#define  RCC_APB2LPENR_TIM1LPEN              ((unsigned int)0x00000001)
#define  RCC_APB2LPENR_TIM8LPEN              ((unsigned int)0x00000002)
#define  RCC_APB2LPENR_USART1LPEN            ((unsigned int)0x00000010)
#define  RCC_APB2LPENR_USART6LPEN            ((unsigned int)0x00000020)
#define  RCC_APB2LPENR_ADC1LPEN              ((unsigned int)0x00000100)
#define  RCC_APB2LPENR_ADC2PEN               ((unsigned int)0x00000200)
#define  RCC_APB2LPENR_ADC3LPEN              ((unsigned int)0x00000400)
#define  RCC_APB2LPENR_SDIOLPEN              ((unsigned int)0x00000800)
#define  RCC_APB2LPENR_SPI1LPEN              ((unsigned int)0x00001000)
#define  RCC_APB2LPENR_SPI4LPEN              ((unsigned int)0x00002000)
#define  RCC_APB2LPENR_SYSCFGLPEN            ((unsigned int)0x00004000)
#define  RCC_APB2LPENR_TIM9LPEN              ((unsigned int)0x00010000)
#define  RCC_APB2LPENR_TIM10LPEN             ((unsigned int)0x00020000)
#define  RCC_APB2LPENR_TIM11LPEN             ((unsigned int)0x00040000)
#define  RCC_APB2LPENR_SPI5LPEN              ((unsigned int)0x00100000)
#define  RCC_APB2LPENR_SPI6LPEN              ((unsigned int)0x00200000)
#define  RCC_APB2LPENR_SAI1LPEN              ((unsigned int)0x00400000)
#define  RCC_APB2LPENR_LTDCLPEN              ((unsigned int)0x04000000)

/********************  Bit definition for RCC_BDCR register  ******************/
#define  RCC_BDCR_LSEON                      ((unsigned int)0x00000001)
#define  RCC_BDCR_LSERDY                     ((unsigned int)0x00000002)
#define  RCC_BDCR_LSEBYP                     ((unsigned int)0x00000004)
#define  RCC_BDCR_LSEMOD                     ((unsigned int)0x00000008)

#define  RCC_BDCR_RTCSEL                    ((unsigned int)0x00000300)
#define  RCC_BDCR_RTCSEL_0                  ((unsigned int)0x00000100)
#define  RCC_BDCR_RTCSEL_1                  ((unsigned int)0x00000200)

#define  RCC_BDCR_RTCEN                      ((unsigned int)0x00008000)
#define  RCC_BDCR_BDRST                      ((unsigned int)0x00010000)

/********************  Bit definition for RCC_CSR register  *******************/
#define  RCC_CSR_LSION                       ((unsigned int)0x00000001)
#define  RCC_CSR_LSIRDY                      ((unsigned int)0x00000002)
#define  RCC_CSR_RMVF                        ((unsigned int)0x01000000)
#define  RCC_CSR_BORRSTF                     ((unsigned int)0x02000000)
#define  RCC_CSR_PADRSTF                     ((unsigned int)0x04000000)
#define  RCC_CSR_PORRSTF                     ((unsigned int)0x08000000)
#define  RCC_CSR_SFTRSTF                     ((unsigned int)0x10000000)
#define  RCC_CSR_WDGRSTF                     ((unsigned int)0x20000000)
#define  RCC_CSR_WWDGRSTF                    ((unsigned int)0x40000000)
#define  RCC_CSR_LPWRRSTF                    ((unsigned int)0x80000000)

/********************  Bit definition for RCC_SSCGR register  *****************/
#define  RCC_SSCGR_MODPER                    ((unsigned int)0x00001FFF)
#define  RCC_SSCGR_INCSTEP                   ((unsigned int)0x0FFFE000)
#define  RCC_SSCGR_SPREADSEL                 ((unsigned int)0x40000000)
#define  RCC_SSCGR_SSCGEN                    ((unsigned int)0x80000000)

/********************  Bit definition for RCC_PLLI2SCFGR register  ************/
#define  RCC_PLLI2SCFGR_PLLI2SM              ((unsigned int)0x0000003F)
#define  RCC_PLLI2SCFGR_PLLI2SM_0            ((unsigned int)0x00000001)
#define  RCC_PLLI2SCFGR_PLLI2SM_1            ((unsigned int)0x00000002)
#define  RCC_PLLI2SCFGR_PLLI2SM_2            ((unsigned int)0x00000004)
#define  RCC_PLLI2SCFGR_PLLI2SM_3            ((unsigned int)0x00000008)
#define  RCC_PLLI2SCFGR_PLLI2SM_4            ((unsigned int)0x00000010)
#define  RCC_PLLI2SCFGR_PLLI2SM_5            ((unsigned int)0x00000020)

#define  RCC_PLLI2SCFGR_PLLI2SN              ((unsigned int)0x00007FC0)
#define  RCC_PLLI2SCFGR_PLLI2SN_0            ((unsigned int)0x00000040)
#define  RCC_PLLI2SCFGR_PLLI2SN_1            ((unsigned int)0x00000080)
#define  RCC_PLLI2SCFGR_PLLI2SN_2            ((unsigned int)0x00000100)
#define  RCC_PLLI2SCFGR_PLLI2SN_3            ((unsigned int)0x00000200)
#define  RCC_PLLI2SCFGR_PLLI2SN_4            ((unsigned int)0x00000400)
#define  RCC_PLLI2SCFGR_PLLI2SN_5            ((unsigned int)0x00000800)
#define  RCC_PLLI2SCFGR_PLLI2SN_6            ((unsigned int)0x00001000)
#define  RCC_PLLI2SCFGR_PLLI2SN_7            ((unsigned int)0x00002000)
#define  RCC_PLLI2SCFGR_PLLI2SN_8            ((unsigned int)0x00004000)

