raphui/rnk/include/stm32f429.h
#define  RCC_PLLI2SCFGR_PLLI2SQ              ((unsigned int)0x0F000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_0            ((unsigned int)0x01000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_1            ((unsigned int)0x02000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_2            ((unsigned int)0x04000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_3            ((unsigned int)0x08000000)

#define  RCC_PLLI2SCFGR_PLLI2SR              ((unsigned int)0x70000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_0            ((unsigned int)0x10000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_1            ((unsigned int)0x20000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_2            ((unsigned int)0x40000000)

/********************  Bit definition for RCC_PLLSAICFGR register  ************/
#define  RCC_PLLSAICFGR_PLLSAIN              ((unsigned int)0x00007FC0)
#define  RCC_PLLSAICFGR_PLLSAIN_0            ((unsigned int)0x00000040)
#define  RCC_PLLSAICFGR_PLLSAIN_1            ((unsigned int)0x00000080)
#define  RCC_PLLSAICFGR_PLLSAIN_2            ((unsigned int)0x00000100)
#define  RCC_PLLSAICFGR_PLLSAIN_3            ((unsigned int)0x00000200)
#define  RCC_PLLSAICFGR_PLLSAIN_4            ((unsigned int)0x00000400)
#define  RCC_PLLSAICFGR_PLLSAIN_5            ((unsigned int)0x00000800)
#define  RCC_PLLSAICFGR_PLLSAIN_6            ((unsigned int)0x00001000)
#define  RCC_PLLSAICFGR_PLLSAIN_7            ((unsigned int)0x00002000)
#define  RCC_PLLSAICFGR_PLLSAIN_8            ((unsigned int)0x00004000)

#define  RCC_PLLSAICFGR_PLLSAIQ              ((unsigned int)0x0F000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_0            ((unsigned int)0x01000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_1            ((unsigned int)0x02000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_2            ((unsigned int)0x04000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_3            ((unsigned int)0x08000000)

#define  RCC_PLLSAICFGR_PLLSAIR              ((unsigned int)0x70000000)
#define  RCC_PLLSAICFGR_PLLSAIR_0            ((unsigned int)0x10000000)
#define  RCC_PLLSAICFGR_PLLSAIR_1            ((unsigned int)0x20000000)
#define  RCC_PLLSAICFGR_PLLSAIR_2            ((unsigned int)0x40000000)

/********************  Bit definition for RCC_DCKCFGR register  ***************/
#define  RCC_DCKCFGR_PLLI2SDIVQ              ((unsigned int)0x0000001F)
#define  RCC_DCKCFGR_PLLSAIDIVQ              ((unsigned int)0x00001F00)
#define  RCC_DCKCFGR_PLLSAIDIVR              ((unsigned int)0x00030000)

#define  RCC_DCKCFGR_SAI1ASRC                ((unsigned int)0x00300000)
#define  RCC_DCKCFGR_SAI1ASRC_0              ((unsigned int)0x00100000)
#define  RCC_DCKCFGR_SAI1ASRC_1              ((unsigned int)0x00200000)

#define  RCC_DCKCFGR_SAI1BSRC                ((unsigned int)0x00C00000)
#define  RCC_DCKCFGR_SAI1BSRC_0              ((unsigned int)0x00400000)
#define  RCC_DCKCFGR_SAI1BSRC_1              ((unsigned int)0x00800000)

#define  RCC_DCKCFGR_TIMPRE                  ((unsigned int)0x01000000)
#define  RCC_DCKCFGR_CK48MSEL                ((unsigned int)0x08000000)

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN                         ((unsigned int)0x00000004)
#define RNG_CR_IE                            ((unsigned int)0x00000008)

/********************  Bits definition for RNG_SR register  *******************/
#define RNG_SR_DRDY                          ((unsigned int)0x00000001)
#define RNG_SR_CECS                          ((unsigned int)0x00000002)
#define RNG_SR_SECS                          ((unsigned int)0x00000004)
#define RNG_SR_CEIS                          ((unsigned int)0x00000020)
#define RNG_SR_SEIS                          ((unsigned int)0x00000040)

/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_PM                            ((unsigned int)0x00400000)
#define RTC_TR_HT                            ((unsigned int)0x00300000)
#define RTC_TR_HT_0                          ((unsigned int)0x00100000)
#define RTC_TR_HT_1                          ((unsigned int)0x00200000)
#define RTC_TR_HU                            ((unsigned int)0x000F0000)
#define RTC_TR_HU_0                          ((unsigned int)0x00010000)
#define RTC_TR_HU_1                          ((unsigned int)0x00020000)
#define RTC_TR_HU_2                          ((unsigned int)0x00040000)
#define RTC_TR_HU_3                          ((unsigned int)0x00080000)
#define RTC_TR_MNT                           ((unsigned int)0x00007000)
#define RTC_TR_MNT_0                         ((unsigned int)0x00001000)
#define RTC_TR_MNT_1                         ((unsigned int)0x00002000)
#define RTC_TR_MNT_2                         ((unsigned int)0x00004000)
#define RTC_TR_MNU                           ((unsigned int)0x00000F00)
#define RTC_TR_MNU_0                         ((unsigned int)0x00000100)
#define RTC_TR_MNU_1                         ((unsigned int)0x00000200)
#define RTC_TR_MNU_2                         ((unsigned int)0x00000400)
#define RTC_TR_MNU_3                         ((unsigned int)0x00000800)
#define RTC_TR_ST                            ((unsigned int)0x00000070)
#define RTC_TR_ST_0                          ((unsigned int)0x00000010)
#define RTC_TR_ST_1                          ((unsigned int)0x00000020)
#define RTC_TR_ST_2                          ((unsigned int)0x00000040)
#define RTC_TR_SU                            ((unsigned int)0x0000000F)
#define RTC_TR_SU_0                          ((unsigned int)0x00000001)
#define RTC_TR_SU_1                          ((unsigned int)0x00000002)
#define RTC_TR_SU_2                          ((unsigned int)0x00000004)
#define RTC_TR_SU_3                          ((unsigned int)0x00000008)

