raphui/rnk/include/stm32f429.h
/*----------------------------------------------------------------------------*/

#define  TIM_CCMR2_IC3PSC                    ((unsigned short)0x000C)            /*!<IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define  TIM_CCMR2_IC3PSC_0                  ((unsigned short)0x0004)            /*!<Bit 0 */
#define  TIM_CCMR2_IC3PSC_1                  ((unsigned short)0x0008)            /*!<Bit 1 */

#define  TIM_CCMR2_IC3F                      ((unsigned short)0x00F0)            /*!<IC3F[3:0] bits (Input Capture 3 Filter) */
#define  TIM_CCMR2_IC3F_0                    ((unsigned short)0x0010)            /*!<Bit 0 */
#define  TIM_CCMR2_IC3F_1                    ((unsigned short)0x0020)            /*!<Bit 1 */
#define  TIM_CCMR2_IC3F_2                    ((unsigned short)0x0040)            /*!<Bit 2 */
#define  TIM_CCMR2_IC3F_3                    ((unsigned short)0x0080)            /*!<Bit 3 */

#define  TIM_CCMR2_IC4PSC                    ((unsigned short)0x0C00)            /*!<IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define  TIM_CCMR2_IC4PSC_0                  ((unsigned short)0x0400)            /*!<Bit 0 */
#define  TIM_CCMR2_IC4PSC_1                  ((unsigned short)0x0800)            /*!<Bit 1 */

#define  TIM_CCMR2_IC4F                      ((unsigned short)0xF000)            /*!<IC4F[3:0] bits (Input Capture 4 Filter) */
#define  TIM_CCMR2_IC4F_0                    ((unsigned short)0x1000)            /*!<Bit 0 */
#define  TIM_CCMR2_IC4F_1                    ((unsigned short)0x2000)            /*!<Bit 1 */
#define  TIM_CCMR2_IC4F_2                    ((unsigned short)0x4000)            /*!<Bit 2 */
#define  TIM_CCMR2_IC4F_3                    ((unsigned short)0x8000)            /*!<Bit 3 */

/*******************  Bit definition for TIM_CCER register  *******************/
#define  TIM_CCER_CC1E                       ((unsigned short)0x0001)            /*!<Capture/Compare 1 output enable                 */
#define  TIM_CCER_CC1P                       ((unsigned short)0x0002)            /*!<Capture/Compare 1 output Polarity               */
#define  TIM_CCER_CC1NE                      ((unsigned short)0x0004)            /*!<Capture/Compare 1 Complementary output enable   */
#define  TIM_CCER_CC1NP                      ((unsigned short)0x0008)            /*!<Capture/Compare 1 Complementary output Polarity */
#define  TIM_CCER_CC2E                       ((unsigned short)0x0010)            /*!<Capture/Compare 2 output enable                 */
#define  TIM_CCER_CC2P                       ((unsigned short)0x0020)            /*!<Capture/Compare 2 output Polarity               */
#define  TIM_CCER_CC2NE                      ((unsigned short)0x0040)            /*!<Capture/Compare 2 Complementary output enable   */
#define  TIM_CCER_CC2NP                      ((unsigned short)0x0080)            /*!<Capture/Compare 2 Complementary output Polarity */
#define  TIM_CCER_CC3E                       ((unsigned short)0x0100)            /*!<Capture/Compare 3 output enable                 */
#define  TIM_CCER_CC3P                       ((unsigned short)0x0200)            /*!<Capture/Compare 3 output Polarity               */
#define  TIM_CCER_CC3NE                      ((unsigned short)0x0400)            /*!<Capture/Compare 3 Complementary output enable   */
#define  TIM_CCER_CC3NP                      ((unsigned short)0x0800)            /*!<Capture/Compare 3 Complementary output Polarity */
#define  TIM_CCER_CC4E                       ((unsigned short)0x1000)            /*!<Capture/Compare 4 output enable                 */
#define  TIM_CCER_CC4P                       ((unsigned short)0x2000)            /*!<Capture/Compare 4 output Polarity               */
#define  TIM_CCER_CC4NP                      ((unsigned short)0x8000)            /*!<Capture/Compare 4 Complementary output Polarity */

/*******************  Bit definition for TIM_CNT register  ********************/
#define  TIM_CNT_CNT                         ((unsigned short)0xFFFF)            /*!<Counter Value            */

/*******************  Bit definition for TIM_PSC register  ********************/
#define  TIM_PSC_PSC                         ((unsigned short)0xFFFF)            /*!<Prescaler Value          */

/*******************  Bit definition for TIM_ARR register  ********************/
#define  TIM_ARR_ARR                         ((unsigned short)0xFFFF)            /*!<actual auto-reload Value */

/*******************  Bit definition for TIM_RCR register  ********************/
#define  TIM_RCR_REP                         ((unsigned char)0xFF)               /*!<Repetition Counter Value */

/*******************  Bit definition for TIM_CCR1 register  *******************/
#define  TIM_CCR1_CCR1                       ((unsigned short)0xFFFF)            /*!<Capture/Compare 1 Value  */

/*******************  Bit definition for TIM_CCR2 register  *******************/
#define  TIM_CCR2_CCR2                       ((unsigned short)0xFFFF)            /*!<Capture/Compare 2 Value  */

/*******************  Bit definition for TIM_CCR3 register  *******************/
#define  TIM_CCR3_CCR3                       ((unsigned short)0xFFFF)            /*!<Capture/Compare 3 Value  */

/*******************  Bit definition for TIM_CCR4 register  *******************/
#define  TIM_CCR4_CCR4                       ((unsigned short)0xFFFF)            /*!<Capture/Compare 4 Value  */

/*******************  Bit definition for TIM_BDTR register  *******************/
#define  TIM_BDTR_DTG                        ((unsigned short)0x00FF)            /*!<DTG[0:7] bits (Dead-Time Generator set-up) */
#define  TIM_BDTR_DTG_0                      ((unsigned short)0x0001)            /*!<Bit 0 */
#define  TIM_BDTR_DTG_1                      ((unsigned short)0x0002)            /*!<Bit 1 */
#define  TIM_BDTR_DTG_2                      ((unsigned short)0x0004)            /*!<Bit 2 */
#define  TIM_BDTR_DTG_3                      ((unsigned short)0x0008)            /*!<Bit 3 */
#define  TIM_BDTR_DTG_4                      ((unsigned short)0x0010)            /*!<Bit 4 */
#define  TIM_BDTR_DTG_5                      ((unsigned short)0x0020)            /*!<Bit 5 */
#define  TIM_BDTR_DTG_6                      ((unsigned short)0x0040)            /*!<Bit 6 */
#define  TIM_BDTR_DTG_7                      ((unsigned short)0x0080)            /*!<Bit 7 */

#define  TIM_BDTR_LOCK                       ((unsigned short)0x0300)            /*!<LOCK[1:0] bits (Lock Configuration) */
#define  TIM_BDTR_LOCK_0                     ((unsigned short)0x0100)            /*!<Bit 0 */
#define  TIM_BDTR_LOCK_1                     ((unsigned short)0x0200)            /*!<Bit 1 */

#define  TIM_BDTR_OSSI                       ((unsigned short)0x0400)            /*!<Off-State Selection for Idle mode */
#define  TIM_BDTR_OSSR                       ((unsigned short)0x0800)            /*!<Off-State Selection for Run mode  */
#define  TIM_BDTR_BKE                        ((unsigned short)0x1000)            /*!<Break enable                      */
#define  TIM_BDTR_BKP                        ((unsigned short)0x2000)            /*!<Break Polarity                    */
#define  TIM_BDTR_AOE                        ((unsigned short)0x4000)            /*!<Automatic Output enable           */
#define  TIM_BDTR_MOE                        ((unsigned short)0x8000)            /*!<Main Output enable                */

/*******************  Bit definition for TIM_DCR register  ********************/
#define  TIM_DCR_DBA                         ((unsigned short)0x001F)            /*!<DBA[4:0] bits (DMA Base Address) */
#define  TIM_DCR_DBA_0                       ((unsigned short)0x0001)            /*!<Bit 0 */
#define  TIM_DCR_DBA_1                       ((unsigned short)0x0002)            /*!<Bit 1 */
#define  TIM_DCR_DBA_2                       ((unsigned short)0x0004)            /*!<Bit 2 */
#define  TIM_DCR_DBA_3                       ((unsigned short)0x0008)            /*!<Bit 3 */
#define  TIM_DCR_DBA_4                       ((unsigned short)0x0010)            /*!<Bit 4 */

#define  TIM_DCR_DBL                         ((unsigned short)0x1F00)            /*!<DBL[4:0] bits (DMA Burst Length) */
#define  TIM_DCR_DBL_0                       ((unsigned short)0x0100)            /*!<Bit 0 */
#define  TIM_DCR_DBL_1                       ((unsigned short)0x0200)            /*!<Bit 1 */
#define  TIM_DCR_DBL_2                       ((unsigned short)0x0400)            /*!<Bit 2 */
#define  TIM_DCR_DBL_3                       ((unsigned short)0x0800)            /*!<Bit 3 */
#define  TIM_DCR_DBL_4                       ((unsigned short)0x1000)            /*!<Bit 4 */

/*******************  Bit definition for TIM_DMAR register  *******************/
#define  TIM_DMAR_DMAB                       ((unsigned short)0xFFFF)            /*!<DMA register for burst accesses                    */

/*******************  Bit definition for TIM_OR register  *********************/
#define TIM_OR_TI4_RMP                       ((unsigned short)0x00C0)            /*!<TI4_RMP[1:0] bits (TIM5 Input 4 remap)             */
#define TIM_OR_TI4_RMP_0                     ((unsigned short)0x0040)            /*!<Bit 0 */
#define TIM_OR_TI4_RMP_1                     ((unsigned short)0x0080)            /*!<Bit 1 */
#define TIM_OR_ITR1_RMP                      ((unsigned short)0x0C00)            /*!<ITR1_RMP[1:0] bits (TIM2 Internal trigger 1 remap) */
#define TIM_OR_ITR1_RMP_0                    ((unsigned short)0x0400)            /*!<Bit 0 */
#define TIM_OR_ITR1_RMP_1                    ((unsigned short)0x0800)            /*!<Bit 1 */


/******************************************************************************/
/*                                                                            */
/*         Universal Synchronous Asynchronous Receiver Transmitter            */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for USART_SR register  *******************/
#define  USART_SR_PE                         ((unsigned short)0x0001)            /*!<Parity Error                 */
#define  USART_SR_FE                         ((unsigned short)0x0002)            /*!<Framing Error                */
#define  USART_SR_NE                         ((unsigned short)0x0004)            /*!<Noise Error Flag             */
#define  USART_SR_ORE                        ((unsigned short)0x0008)            /*!<OverRun Error                */
#define  USART_SR_IDLE                       ((unsigned short)0x0010)            /*!<IDLE line detected           */
#define  USART_SR_RXNE                       ((unsigned short)0x0020)            /*!<Read Data Register Not Empty */
#define  USART_SR_TC                         ((unsigned short)0x0040)            /*!<Transmission Complete        */
#define  USART_SR_TXE                        ((unsigned short)0x0080)            /*!<Transmit Data Register Empty */
#define  USART_SR_LBD                        ((unsigned short)0x0100)            /*!<LIN Break Detection Flag     */
#define  USART_SR_CTS                        ((unsigned short)0x0200)            /*!<CTS Flag                     */

/*******************  Bit definition for USART_DR register  *******************/
#define  USART_DR_DR                         ((unsigned short)0x01FF)            /*!<Data value */

